[{"bodyLinks":"body_|web|http://examine.com/supplements/Policosanol/|More Information:__","FeedId":"edcc4a45-cd59-4ae3-a9bb-48d065068715","category":"sol_heart","title":"Policosanol Is Safe \u0026 Lowers Cholesterol \u0026 Triglycerides","author":"","shortDescription":"Policosanol Is Safe \u0026 Lowers Cholesterol \u0026 Triglycerides","description":"Policosanol is a natural supplement derived from sugar cane. It is a mixture of eight higher primary aliphatic alcohols isolated and purified from sugar cane wax. Policosanol promotes healthy platelet function and helps to maintain cholesterol levels that are already within the normal range.Animal and human studies have also shown that policosanol is an antioxidant. When used in long-term clinical trials, policosanol was well tolerated and safe. Typical doses of 5-80 mg daily for up to 3 years is safe but it can cause skin redness and rash, migraines, insomnia or drowsiness, irritability, dizziness, upset stomach, increased appetite, trouble urinating, weight loss, nose and gum bleeds, and other side effects. Pregnancy and breast-feeding: There is not enough reliable information about the safety of taking policosanol if you are pregnant or breast-feeding. Stay on the safe side and avoid use. Policosanol can slow blood clotting and might increase the chance of bleeding in people with bleeding disorders.  There is a concern that it might increase the chance of extra bleeding during and after surgery. Stop using policosanol at least 2 weeks before a scheduled surgery.","link":"","linkType":"category","linkValue":null,"image":"img_default/1_heart.png","publishedDate":"\/Date(1441347982520)\/","rank":60,"beginDate":"\/Date(1441263600000)\/","endDate":"\/Date(1441263600000)\/","totalRows":0,"warnings":null,"sideeffects":null,"dosage":"","anticoagulant":false,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":null,"state":null,"postalCode":null,"country":null,"areaCode":null,"closed":false,"carousel":true,"carousel_caption":"Policosanol Is Safe \u0026 Lowers Cholesterol \u0026 Triglycerides","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"}]
