[{"bodyLinks":"","FeedId":"10c71a51-b970-4587-a4a5-0d43e70e0463","category":"sol_diabetes","title":"Na-R-ALA R-Lipoic Acid","author":"","shortDescription":"Na-R-ALA R-Lipoic Acid is used for diabetes and nerve-related symptoms of diabetes including burning, pain, and numbness in the legs and arms. \u0026nbsp;Na-R-ALA R-Lipoic Acid is the Sodium (Na) salt of Alpha R-Lipoic Acid. \u003cb\u003eNEVER \u003c/b\u003etake plain \"Alpha R-Lipoic Acid\" because it i\u003cb\u003es so acidic it can burn your esophagus\u003c/b\u003e. Sales of the un-buffered \"Alpha R-Lipoic Acid\" should be banned. The sodium salt, Na-R-ALA R-Lipoic Acid, is not acid when you swallow it BUT breaks down very quickly and can still cause severe acid reflux if not taken with food.","description":"\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eNa-R-ALA R-Lipoic Acid is used for diabetes and nerve-related symptoms of diabetes including burning, pain, and numbness in the legs and arms. High doses of Na-R-ALA R-Lipoic Acid are approved in Germany for the treatment of these symptoms. Some people use Na-R-ALA R-Lipoic Acid acid for memory loss, chronic fatigue syndrome (CFS), HIV/AIDS, cancer, liver disease, diseases of the heart and blood vessels (including a disorder called cardiac autonomic neuropathy) and Lyme disease. Na-R-ALA R-Lipoic Acid is also used to treat eye-related disorders, such as damage to the retina, cataracts, glaucoma, and an eye disease called Wilson’s disease. There is also evidence that Na-R-ALA R-Lipoic Acid can improve the function and conduction of neurons in diabetes.\u003c/div\u003e","link":"","linkType":"category","linkValue":"","image":"img_default/1_diabetes.png","publishedDate":"\/Date(1480323677853)\/","rank":100,"beginDate":"\/Date(1480323677853)\/","endDate":"\/Date(1480323677853)\/","totalRows":0,"warnings":"Na-R-ALA R-Lipoic Acid \u0026nbsp;can decrease blood sugar levels. Your diabetes medications might need to be adjusted by your healthcare provider. Excessive use of alcohol/thiamine deficiency: Alcohol can lower the amount of thiamine (vitamin B1) in the body. Taking Na-R-ALA R-Lipoic Acid \u0026nbsp;when there is a shortage of thiamine might cause serious health problems. If you drink a lot of alcohol and take alpha-lipoic acid too, you should take a thiamine supplement. Taking alpha-lipoic acid might interfere with treatments for under-active or over-active thyroid.","sideeffects":"","dosage":"200 mg 3x day","anticoagulant":false,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":false,"carousel_caption":"","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"","FeedId":"7052cc66-16bc-4bdc-a505-cb80bfdc5315","category":"sol_diabetes","title":"Marijuana","author":"","shortDescription":"Researchers at the University of California San Diego tested inhaled cannabis for treating pain caused by diabetic peripheral neuropathy (DPN). Results showed there was a dose-dependent reduction in pain intensity from inhaled cannabis, which the authors noted is consistent with results of other trials of the drug for diverse neuropathic pain syndromes.","description":"Researchers at the University of California San Diego tested inhaled cannabis for treating pain caused by diabetic peripheral neuropathy (DPN). Results showed there was a dose-dependent reduction in pain intensity from inhaled cannabis, which the authors noted is consistent with results of other trials of the drug for diverse neuropathic pain syndromes.","link":"","linkType":"category","linkValue":"","image":"img_default/1_diabetes.png","publishedDate":"\/Date(1480286487030)\/","rank":100,"beginDate":"\/Date(1480286487030)\/","endDate":"\/Date(1480286487030)\/","totalRows":0,"warnings":"","sideeffects":"","dosage":"","anticoagulant":false,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":false,"carousel_caption":"","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"","FeedId":"5ab2fe0b-bc84-4cea-b9cb-cf4f81ecc952","category":"sol_diabetes","title":"magnesium-L-threonate (MgT)","author":"","shortDescription":"Low Magnesium May Play Key Role in Neuropathy, Insulin Resistance and Diabetes..","description":"Magnesium plays a key role in preventing insulin dysregulation and type 2 diabetes, according to several recent studies—yet 80 percent of Americans are likely magnesium deficient\nOne study found those with the highest magnesium intake reduced their risk of metabolic problems by 71 percent\nAnother study concluded magnesium is highly protective for those at high risk for type 2 diabetes\nInadequate magnesium intake creates a vicious cycle of low magnesium levels in your body, elevated insulin and blood glucose levels, and excess loss of magnesium in your urine\nThe best source of magnesium is whole, organic foods, especially dark green leafy vegetables; other good sources include seaweed, dried pumpkin seeds, unsweetened cocoa, flaxseed, almond butter, and whey\nOf the many forms of magnesium supplements available today, a newer form called magnesium threonate shows particular promise due to its ability to penetrate cell membranes, even those in your brain","link":"","linkType":"category","linkValue":"","image":"img_default/1_diabetes.png","publishedDate":"\/Date(1479382905863)\/","rank":100,"beginDate":"\/Date(1479382905863)\/","endDate":"\/Date(1479382905863)\/","totalRows":0,"warnings":"If you take too much magnesium, this could lead to potentially serious side-effects. For some users, taking very large doses, can lead to low blood pressure, severe brain fog, and an irregular heartbeat. In extreme, rare cases, overdoses can result in death. If you have issues with your kidneys, then magnesium supplements should be avoided. This of course also relates to anyone that is taking kidney-related medication. When you add more magnesium to your routine, it can be become overwhelming for your kidneys. The same is true for anyone that has a heart condition, as irregular heart beats are a possibility. At this point in time, there has been limited research conducted on Magnesium L-Threonate. However, side-effects will be similar to those that are experienced when taking Magnesium Sulfate.","sideeffects":"","dosage":"200mg - 400mg 1x day","anticoagulant":false,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":true,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":false,"carousel_caption":"","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"body_|web|http://phys.org/news/2007-07-pumpkin-fairytale-insulin.html#jCp|Read more at:__","FeedId":"9fea5bf8-a62e-4baa-b871-691b84782f85","category":"sol_diabetes","title":"Pumpkin","author":"","shortDescription":"Pumpkin May Be A Fairytale End to Insulin Injections","description":"The protective effect of pumpkin is thought to be due to both antioxidants and D-chiro-inositol, a molecule that mediates insulin activity. Boosting insulin levels has the effect of lowering blood sugar levels, which reduces levels of oxidative oxygen species that damage beta-cell membranes, preventing further damage and allowing for some regeneration. Beta cells levels in the diabetic rats are, however, unlikely ever to reach that of controls, because some of the cells will have been damaged beyond repair.","link":"","linkType":"category","linkValue":"","image":"img_default/1_diabetes.png","publishedDate":"\/Date(1441350447487)\/","rank":100,"beginDate":"\/Date(1441274400000)\/","endDate":"\/Date(1441274400000)\/","totalRows":0,"warnings":"","sideeffects":"","dosage":"","anticoagulant":false,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":true,"carousel_caption":"Pumpkin May Be A Fairytale End to Insulin Injections","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"","FeedId":"994dbbe4-999d-4452-bb6a-062ce3219734","category":"sol_diabetes","title":"Pulsed Magnetic Therapy (PEMF)","author":"","shortDescription":"Studies have shown that a pulsed magnetic field of 1 Hz, 5 Hz, 10 Hz, and 73 Hz applied over the motor cortex for 20-minute sessions can help relieve the pain of neuropathy. See:\u003cbr\u003e\u003ca href=\"https://www.youtube.com/watch?v=AMJVyoKJtn4\" target=\"_blank\"\u003ehttps://www.youtube.com/watch?v=AMJVyoKJtn4\u003c/a\u003e\u003cbr\u003e","description":"Studies have shown that a pulsed magnetic field of 1 Hz, 5 Hz, 10 Hz, and 73 Hz applied over the motor cortex for 20-minute sessions can help relieve the pain of neuropathy. See:\u003cbr\u003e\u003ca href=\"https://www.youtube.com/watch?v=AMJVyoKJtn4\" target=\"_blank\"\u003ehttps://www.youtube.com/watch?v=AMJVyoKJtn4\u003c/a\u003e\u003cbr\u003e","link":"","linkType":"category","linkValue":"","image":"img_default/1_diabetes.png","publishedDate":"\/Date(1480320588627)\/","rank":99,"beginDate":"\/Date(1480320588627)\/","endDate":"\/Date(1480320588627)\/","totalRows":0,"warnings":"","sideeffects":"","dosage":"","anticoagulant":false,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":false,"carousel_caption":"","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"","FeedId":"2399b77e-2380-42c7-89f4-6e35878bbc18","category":"sol_diabetes","title":"Pyridoxamine Dihychloride","author":"","shortDescription":"Extremely effective in slowing progression of neuropathy. May REVERSE neuropathy. There are 3 active forms of Vitamin B6 and all three of these forms, including Pyridoxamine Dihychloride, can cause severe neurological damage in some individuals and with higher doses. This is a double-edged sword so be very careful with this chemical--all supplements or chemicals or combinations of hundreds of chemicals.","description":"Extremely effective in slowing progression of neuropathy. May REVERSE neuropathy. There are 3 active forms of Vitamin B6 and all three of these forms, including Pyridoxamine Dihychloride, can cause severe neurological damage in some individuals and with higher doses. This is a double-edged sword so be very careful with this chemical--all supplements or chemicals or combinations of hundreds of chemicals.","link":"","linkType":"category","linkValue":"","image":"img_default/1_diabetes.png","publishedDate":"\/Date(1480313297933)\/","rank":99,"beginDate":"\/Date(1480313297933)\/","endDate":"\/Date(1480313297933)\/","totalRows":0,"warnings":"Can in some individuals and at higher doses produce severe neurological damage.","sideeffects":"","dosage":"50 mg 1x day 1x day","anticoagulant":false,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":false,"carousel_caption":"","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"","FeedId":"0d5c92dd-3911-45ed-b83e-119eddbcd190","category":"sol_diabetes","title":"DHCB (dehydrocorybulbine)","author":"","shortDescription":"DHCB (dehydrocorybulbine), a compound isolated from the roots of the Corydalis yanhusuo plant, has been found effective at alleviating pain. In tests on rodents, DHCB proved to diminish both inflammatory pain, which is associated with tissue damage and the infiltration of immune cells, and injury-induced neuropathic pain, which is caused by damage to the nervous system. Researchers found that DHCB did not generate the tolerance seen with continued use of most conventional pain relievers, such as morphine.","description":"DHCB (dehydrocorybulbine), a compound isolated from the roots of the Corydalis yanhusuo plant, has been found effective at alleviating pain. In tests on rodents, DHCB proved to diminish both inflammatory pain, which is associated with tissue damage and the infiltration of immune cells, and injury-induced neuropathic pain, which is caused by damage to the nervous system. Researchers found that DHCB did not generate the tolerance seen with continued use of most conventional pain relievers, such as morphine.","link":"","linkType":"category","linkValue":"","image":"img_default/1_diabetes.png","publishedDate":"\/Date(1480310418637)\/","rank":99,"beginDate":"\/Date(1480310418637)\/","endDate":"\/Date(1480310418637)\/","totalRows":0,"warnings":"Like almost all \"natural\" supplements that are plant extracts and contain hundreds of chemicals that have NEVER been studied for their harmful effects in the human body DHCB should not be taken except in the case of extreme pain and only under a doctor\u0027s supervision. It is most likely that any extracts of this plant also contain very harmful chemicals.","sideeffects":"","dosage":"","anticoagulant":false,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":false,"carousel_caption":"","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"","FeedId":"e73ba877-7b32-481e-ac57-234e5ba94916","category":"sol_diabetes","title":"Taking Blood Pressure Drugs at Night May Help Prevent Type 2 Diabetes","author":"","shortDescription":"Taking Blood Pressure Drugs at Night May Help Prevent Type 2 Diabetes","description":"In surprising new research, experts report that the timing of taking your blood pressure medicine could have a big impact on whether or not you develop type 2 diabetes. Spanish researchers found that taking blood pressure medications at bedtime rather than waiting until morning may cut the risk of developing type 2 diabetes by more than half. People with high blood pressure tend to suffer from a phenomenon called non-dipping, in which their blood pressure does not substantially decrease during sleep as it does in healthy people, the researchers said in background information. In an initial study, the investigators found that non-dippers tended to have an increased risk of developing type 2 diabetes, compared with people whose blood pressure decreased normally during sleep. A follow-up clinical trial by the same research group revealed that taking high blood pressure medications right before bed helped lower a person\u0027s sleeping blood pressure, and the risk of type 2 diabetes. For every 14-point decrease in a person\u0027s average sleeping systolic blood pressure, they experienced a 30 percent reduction in their risk of developing type 2 diabetes, said lead author Dr. Ramon Hermida. Systolic pressure is the top number in a blood pressure reading. Hormones such as adrenaline and angiotensin play a role in the development of both high blood pressure and type 2 diabetes. A number of blood pressure medications specifically target angiotensin, a hormone that causes blood vessels to constrict and blood pressure to rise, Bloomgarden said. Angiotensin also contributes to increased glucose (sugar) release from the liver and decreased insulin sensitivity. Drugs that target angiotensin include angiotensin receptor blockers (ARBs), ACE inhibitors and beta blockers. All three classes of medication were associated with a reduced risk of type 2 diabetes when taken at bedtime, the researchers found. After showing that reduced blood pressure during sleep was associated with lower risk of type 2 diabetes, the researchers decided to see whether taking an entire daily dose of one or more blood pressure medications at bedtime could drive a person\u0027s type 2 diabetes risk down even more. The clinical trial involved more than 2,000 people who had high blood pressure but not diabetes. They were randomly assigned to take all their blood pressure medications either first thing in the morning or right before bed. During an average six-year follow up, 171 of the participants developed type 2 diabetes. Study volunteers in the bedtime-treatment group experienced a significant reduction in their sleeping blood pressure, with non-dipping occurring in only 32 percent of their group, compared with 52 percent of the patients who took their medication in the morning, according to the study results. The study found the risk of developing type 2 diabetes was 57 percent lower in the bedtime-treated group than the morning group after researchers adjusted for other complicating factors.","link":"","linkType":"category","linkValue":"","image":"img_default/1_diabetes.png","publishedDate":"\/Date(1443198868230)\/","rank":99,"beginDate":"\/Date(1443164400000)\/","endDate":"\/Date(1443164400000)\/","totalRows":0,"warnings":"","sideeffects":null,"dosage":"","anticoagulant":false,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":null,"state":null,"postalCode":null,"country":null,"areaCode":null,"closed":false,"carousel":true,"carousel_caption":"Taking Blood Pressure Drugs at Night May Help Prevent Type 2 Diabetes","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"","FeedId":"81316d27-0c91-47f8-a3de-788ae968ba13","category":"sol_diabetes","title":"Cashew Seed Extract","author":"","shortDescription":"Cashew Seed Extract Could Prevent Diabetes \u0026 Help Diabetics Who Are Insulin Resistent","description":"A new study out of the University of Montreal has found that Cashew Seed Extract is an effective anti-diabetic. The study, published in the journal “Molecular Nutrition \u0026 Food Research,” investigated the reputed health benefits of cashew tree products on diabetes and found that Cashew Seed Extract improves the body’s response to its own insulin. Cashew seed extract significantly stimulated blood sugar absorption by muscle cells. Because other parts of the cashew plant had no such effect, it seems that cashew seed extract likely contains active compounds, which may have potential anti-diabetic properties. Speak to your doctor before adding any supplement for diabetes to your regular routine.","link":"","linkType":"category","linkValue":"","image":"img_default/1_diabetes.png","publishedDate":"\/Date(1441250295327)\/","rank":99,"beginDate":"\/Date(1441188000000)\/","endDate":"\/Date(1441188000000)\/","totalRows":0,"warnings":"","sideeffects":"","dosage":"","anticoagulant":false,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":true,"carousel_caption":"Cashew Seed Extract Could Prevent Diabetes \u0026 Help Diabetics Who Are Insulin Resistent","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"body_|embed_youtube|http://www.youtube.com/embed/6JhXF0VIj50|Watch Video:__","FeedId":"f1844a5d-97f3-4697-adb0-3aeac43b4a37","category":"sol_diabetes","title":"Special Report: Curing Diabetes","author":"","shortDescription":"Special Report: Curing Diabetes","description":"Special Report: Curing Diabetes\nOver 350 million people worldwide are currently living with diabetes, a group all too familiar with the constant symptom management process that comes along with the diagnosis. One company, Orgenesis, isn’t content with just controlling the disease but has instead set out to cure it; and you might be surprised to hear that the secret to ending diabetes may already be inside a patient’s own body. Host, Annamaria Stewart sits down with Orgenesis CEO Scott Carmer to talk more about their novel approach to curing diabetes.","link":"http://www.youtube.com/embed/6JhXF0VIj50","linkType":"embed_youtube","linkValue":"","image":"img_default/1_diabetes.png","publishedDate":"\/Date(1441836115433)\/","rank":98,"beginDate":"\/Date(1441782000000)\/","endDate":"\/Date(1441782000000)\/","totalRows":0,"warnings":null,"sideeffects":null,"dosage":"","anticoagulant":false,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":null,"state":null,"postalCode":null,"country":null,"areaCode":null,"closed":false,"carousel":true,"carousel_caption":"Special Report: Curing Diabetes","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"btn_|embed_youtube|http://www.youtube.com/embed/FulwC5yvgvc|__","FeedId":"8109f776-98a3-4c72-af02-d550a6756848","category":"sol_diabetes","title":"Statins","author":"","shortDescription":"Statin Drugs: A Surprising Cause of Diabetes","description":"Statin drugs can cause rhabdomyolysis which is a FATAL muscle disease so think twice before taking any statin drug. Statins have been shown to dangerously increase your risk of diabetes through different mechanisms. The most important one is that they increase insulin resistance, which can be extremely harmful to your health. Increased insulin resistance leads to heart disease, which, ironically, is the primary reason for taking a cholesterol-reducing drug in the first place. It promotes belly fat, high blood pressure, heart attacks, chronic fatigue, thyroid disruption, and diseases like Parkinson\u0027s, Alzheimer\u0027s, and cancer. Statins raise your blood sugar. Many people have drug-induced diabetes and NOT genuine type 2 diabetes from taking statin drugs. If you take a statin drug and your blood glucose is elevated it may just be the result of taking the statin drug. Many doctors mistakenly diagnose you with type 2 diabetes. The FDA warns on statin labels that some people have developed memory loss or confusion while taking statins. These side effects reverse once you stop taking the medication. Talk to your doctor if you experience memory loss or confusion. There has also been evidence that statins may help with brain function — in patients with dementia or Alzheimer\u0027s, for example. This is still being studied. Don\u0027t stop taking your statin medication before talking to your doctor.","link":"","linkType":"category","linkValue":"","image":"img_default/1_diabetes.png","publishedDate":"\/Date(1441356916740)\/","rank":98,"beginDate":"\/Date(1441274400000)\/","endDate":"\/Date(1441274400000)\/","totalRows":0,"warnings":"","sideeffects":"","dosage":"","anticoagulant":false,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":true,"carousel_caption":"Statin Drugs: A Surprising Cause of Diabetes","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"body_|embed_youtube|http://www.youtube.com/embed/shEmyh2pg_U|Peripheral Neuropathy and Exercise:__","FeedId":"9e66281e-ee8e-4180-9623-ed33ef23f9d9","category":"sol_diabetes","title":"Exercises Proven to Be Effective for Peripheral Neuropathy","author":"","shortDescription":"Exercises Proven to Be Effective for Peripheral Neuropathy","description":"This is the only clinical study we found that tested a series of bery unique exercises fr neuropathy that were proven to be extreemely effective among everyone in the test group. This video will walk you through these exercises:","link":"http://www.youtube.com/embed/shEmyh2pg_U","linkType":"embed_youtube","linkValue":"","image":"img_default/1_diabetes.png","publishedDate":"\/Date(1441239686070)\/","rank":98,"beginDate":"\/Date(1441177200000)\/","endDate":"\/Date(1441177200000)\/","totalRows":0,"warnings":null,"sideeffects":null,"dosage":"","anticoagulant":false,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":null,"state":null,"postalCode":null,"country":null,"areaCode":null,"closed":false,"carousel":true,"carousel_caption":"Exercises Proven to Be Effective for Peripheral Neuropathy","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"","FeedId":"060832fe-38f3-4cc3-9668-156d73531f7c","category":"sol_diabetes","title":"Gastrodin","author":"300 mg QD","shortDescription":"Gastrodin - Neuroregeneration Is Now Possible but the price may be memory loss?","description":"Gastrodin (4-[hydroxymethyl]phenyl-ß-D-glucopyranoside). Your brain is under assault from environmental toxins, oxidant stress, inflammation, blood flow fluctuations, and excess glucose. Collectively, these factors contribute to a state of neurotoxicity that accelerates brain aging resulting in neurodegenerative decline, Parkinson’s, and Alzheimer’s. Currently there are no medical options to halt this steady march toward mental darkness. Pharmaceutical intervention is largely palliative and cannot cure or restore lost brain function.  For thousands of years, Chinese doctors have used gastrodin, extracted from the root of the exotic orchid, Gastrodia elata, to treat a range of cognitive problems ranging from vertigo and headaches to paralysis and seizures. What scientists today are discovering is that gastrodin acts as a broad-spectrum “brain shield” that protects against various factors that cause age-related degradation of our mental processes. The wide ranging brain benefits of gastrodin were long ago identified. What has researchers excited are new findings showing that gastrodin has regenerative properties that include rebalancing neurotransmitters, improving blood flow, decreasing memory loss, protecting brain functions during a stroke, and potentially reducing risk of Alzheimer’s and Parkinsons. In short, gastrodin provides unparalleled, multi-factorial brain protection in both extreme and everyday conditions.  Impressive human studies using gastrodin in hospital settings confirm its benefit in shielding the brain against neurological insults, including protecting the brain against memory loss that can occur when one undergoes open heart surgery! In the discussion that follows, we highlight leading research showing how gastrodin protects against factors that conspire to deteriorate our brain. \n\nNeuroregeneration – Once Thought to be Impossible is now possible. Not so long ago, most scientists thought that adult brain tissue had no hope of regenerating itself. The loss of brain cells and brain function was considered irreversible. According to neurologists, once your brain had finished growing, the ongoing loss of brain cells was just a natural part of aging. But molecular science is revealing startling discoveries about the brain’s ability to heal itself. What scientists have now found is that the brain can regenerate the neurons involved in brain remodeling (plasticity). Plasticity is the process by which brain cells reorganize and restructure their connections to form new memories and facilitate learning. Scientists in China and Singapore have made remarkable findings about how a natural orchid extract called gastrodin stimulates these neuro-regenerative processes. Extracts from the Gastrodia orchid have been shown to have a beneficial influence on up to nearly 20% of the genes that control the brain’s plasticity and regrowth. In the studies, gastrodin was shown to mobilize and activate specific aspects of the brain’s regenerative activities. Instead of succumbing to progressive brain shrinkage with constriction of one’s thoughts, feelings, and memories, brain cells have built-in natural, self-healing systems. Gastrodin can turn on and activate these regenerative mechanisms. This may turn out to be one of the most powerful methods ever discovered for preventing loss of brain function at any age.","link":"","linkType":"category","linkValue":"","image":"img_default/1_diabetes.png","publishedDate":"\/Date(1442244014330)\/","rank":97,"beginDate":"\/Date(1442170800000)\/","endDate":"\/Date(1442170800000)\/","totalRows":0,"warnings":"Gastrodin - Neuroregeneration Is Now Possible but the price may be memory loss?","sideeffects":"","dosage":"300 mg QD","anticoagulant":true,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":true,"carousel_caption":"Gastrodin - Neuroregeneration Is Now Possible","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"","FeedId":"7910b066-ee18-4662-a601-cc0f2eefacf9","category":"sol_diabetes","title":"Omega-3 Fatty Acids","author":"","shortDescription":"One study shows that fish oil supplements can restore the condition of nerves damaged from diabetes in mice. But Fish Oils can have very dangerous side effects.","description":"One study shows that fish oil supplements can restore the condition of nerves damaged from diabetes in mice.\u0026nbsp;Fish oil is FDA approved to lower triglycerides levels. It is also used to lower blood pressure, cholesterol levels, to help in kidney complications related to diabetes, cirrhosis, Berger\u0027s disease (IgA nephropathy), for dry eyes, cataracts, glaucoma, and age-related macular degeneration (AMD), a very common condition in older people that can lead to serious sight problems. Fish oil is taken by mouth for stomach ulcers caused by Helicobacter pylori (H. pylori), inflammatory bowel disease, pancreatitis, an inherited disorder called phenylketonuria, allergy to salicylate, Crohn\u0027s disease, Behcet\u0027s syndrome, and Raynaud\u0027s syndrome.","link":"","linkType":"category","linkValue":"","image":"img_default/1_diabetes.png","publishedDate":"\/Date(1480362324140)\/","rank":90,"beginDate":"\/Date(1480362324140)\/","endDate":"\/Date(1480362324140)\/","totalRows":0,"warnings":"\u003cspan style=\"font-weight: 700;\"\u003eOmega-3 Fish Oils\u003c/span\u003e\u0026nbsp;are\u0026nbsp;\u003cspan style=\"font-weight: 700;\"\u003eanti-coagulants\u003c/span\u003e\u0026nbsp;that can cause bleeding and\u0026nbsp;suppress your immune system. Fish oil can increase the symptoms of Bipolar Disorder, and depression. Fish oil can make control of blood sugar more difficult. \u003cb\u003eFish oil might increases the risk of getting cancer \u003c/b\u003ein people with adenomatous polyposis. Fish oil may cause irregular heartbeat.\u003cdiv\u003e\u003cb\u003eBE SAFE AND AVOID FISH OIL SUPPLEMENTS.\u003c/b\u003e\u003c/div\u003e","sideeffects":"","dosage":"300 mg Omega-3 3x day","anticoagulant":true,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":false,"carousel_caption":"","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"","FeedId":"70e31ccd-83a8-490b-950e-6f8aabd1b7d8","category":"sol_diabetes","title":"Pyridoxamin Dihychloride","author":"50 mg QD","shortDescription":"Pyridoxamin Dihychloride was found to be effective in slowing the progression of diabetic neuropathy in a phase II trial on 224 patients.","description":"Vitamin B-6 - Pyridoxamin Dihydrochloride. There are 3 active forms of Vitamin B6 and the other two forms can cause seve neurological damage. If you do take any form of Vitaman B6 make sure it is the Pyridoxamine Dihydrochloride and not either of the other 2 forms of Vitamin B6.\n\nPyridoxamine was marketed as a dietary supplement, often as the hydrochloride salt, pyridoxamine dihydrochloride. However, in the United States, the FDA ruled in January 2009 that pyridoxamine must be regulated as a pharmaceutical drug because it is the active ingredient in Pyridorin, a drug designed by Biostratum, Inc., to prevent the progression of diabetic nephropathy.\n\nPyridorin had success in early clinical trials, found to be effective in slowing the progression of diabetic neuropathy in a phase II trial on 224 patients. However, in 2005 Biostratum ran out of money and so was unable to begin a Phase III trial. Investors in Biostratum had realized that because Biostratum had no patent on pyridoxamine itself, and that pyridoxamine was commonly available for purchase as a dietary supplement, the company would be unable to charge enough money for the treatment (should it be approved as a prescription drug by the FDA) for the investors to get a reasonable return on the investment they had already made (about $100M) much less on the additional investment a Phase III trial would require. To solve this problem, Biostratum submitted a Citizen Petition to the FDA on July 29, 2005, seeking to disallow sales of pyridoxamine-containing supplements on the grounds that pyridoxamine, as the subject of an Investigational New Drug Application with the FDA, is a drug and not a dietary supplement. On January 12, 2009, the FDA ruled that products containing pyridoxamine are excluded from the definition of dietary supplements as defined by the Dietary Supplement Health and Education Act of 1994. The FDA stated that the status of Pyridorin as an investigational new drug, as a result of an application filed by BioStratum in July 1999 and effective on September 1, 1999, meant that \"the marketing of pyridoxamine in a dietary supplement is essentially equivalent to the marketing of an investigational new drug as a dietary supplement\" because there was an \"absence of independent, verifiable evidence that the substance was marketed as a food or a dietary supplement prior to its authorization for investigation as a new drug.\" In 2006, Biostratum licensed its rights in Pyridorin to another company, NephroGenex In 2008, NephroGenex restarted the clinical development of Pyridorin, which as of 2012 is still ongoing.\n\nImmune System: Vitamin B6 plays an important role in refurbishing the immune system of the human body to the required functional level. This helps the human body to withstand a number of infections, which can easily victimize the body in the absence of this important vitamin.\n\nMetabolism: Vitamin B6 is admired for its capability of metabolizing a number of nutrients to extract energy. Hence, one may look upon this vitamin for the metabolism of fats, vitamins, carbohydrates and other important components like amino acids.\n\nVitamin B6 is helpful in maintaining the level of hormones in the human body, which helps to control a number of activities and metabolic occurrences in the human body.\n\nOne of the most significant benefits of Vitamin B6 is that it helps in maintaining the good condition of human skin. It helps in treating a number of skin problems, including eczema, dandruff, acne, hair loss, and dry skin. More than that, it helps in treating serious skin diseases like melanoma and psoriasis.\n\nThe latest research on Pyridoxamin dihydrochloride is extremely effective in slowing the progression of neuropathy and may in fact REVERSE neuropathy in some individuals and seems to be safe at doses used in previous clinical trials.\n\nBecause this drug is still available from various sources without a prescription please take this drug ONLY under the supervision of your doctor.","link":"","linkType":"category","linkValue":"","image":"img_default/1_diabetes.png","publishedDate":"\/Date(1442223420910)\/","rank":90,"beginDate":"\/Date(1442149200000)\/","endDate":"\/Date(1442149200000)\/","totalRows":0,"warnings":"Clinical trials used 150mg and 300mg bid for one year to reverse neuropathy. However other studies show that dosages above 50mg per day may result in severe neurological nerve damage. Anti-Coagulant. Vitamin B6 may increase the risk of bleeding. Caut","sideeffects":"","dosage":"50 mg 1x day","anticoagulant":false,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":true,"carousel_caption":"Pyridoxamin Dihychloride","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"body_|embed_youtube|http://www.youtube.com/embed/UbNi1lQBU0I|__","FeedId":"65be4633-a84e-4cde-8242-3aceca2165ac","category":"sol_diabetes","title":"Caffeine \u0026 Coffee Make You Insulin Resistent","author":"","shortDescription":"Caffeine \u0026 Coffee Make You Insulin Resistent","description":"Studies have conclusively shown that the increase in blood glucose levels that occurs after they eat carbohydrates is severly exaggerated if they also consume a caffeinated beverage such as coffee. This effect causes much higher glucose levels in people with diabetes leading to greater insulin resistence and making it much more difficult to control sugar levels. In people without diabetes caffeine acts as a simulant but in people with diabetes it can cause extreme sleepiness. Persons with diabetes should avoid caffeinated beverages at all costs.","link":"","linkType":"category","linkValue":"","image":"img_default/1_diabetes.png","publishedDate":"\/Date(1441239192250)\/","rank":87,"beginDate":"\/Date(1441177200000)\/","endDate":"\/Date(1441177200000)\/","totalRows":0,"warnings":"","sideeffects":null,"dosage":"","anticoagulant":false,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":null,"state":null,"postalCode":null,"country":null,"areaCode":null,"closed":false,"carousel":true,"carousel_caption":"Caffeine \u0026 Coffee Make You Insulin Resistent","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"body_|web|http://phys.org/news/2007-12-oral-anti-diabetic-substance.html#jCp|Read more at:__","FeedId":"d6a9cf91-bf0b-48e9-8892-eb3f6e881301","category":"sol_diabetes","title":"GTF","author":"","shortDescription":"GTF is an Oral Anti Diabetic Substance Discovered","description":"Research in the Department of Biology at the Faculty of Science and Science Education of the University of Haifa has discovered a substance that may become an oral treatment for diabetes and its complications. The substance, which is derived from yeast, is called Glucose Tolerance Factor (GTF).  According to Dr. Mirsky, there are a number of problems with insulin treatment; the main one being that insulin is not always an effective treatment, due to gradual development of resistance to the hormone. An additional problem is that insulin doses are not necessarily synchronized with the patient\u0027s physical activities or eating intervals. A large dose of insulin injected before a diabetic patient eats, for example, can cause a sudden drop in blood sugar (hypoglycemia) that can result in a diabetic coma and ultimately death. In addition, the fact that insulin must be injected is in and of itself difficult for many patients. This current research was conducted on two levels: on diabetic rats and on the molecular-cell level. The results indicate that GTF acts similarly to insulin in the rats, lowering the level of glucose, and of LDL-cholesterol, (the \"bad\" cholesterol), and raising the level of HDL-cholesterol (the \"good\" cholesterol). GTF inhibited oxidation processes that can cause atherosclerosis and result in further complications of the disease like strokes and heart attacks.","link":"","linkType":"category","linkValue":"","image":"img_default/1_diabetes.png","publishedDate":"\/Date(1441352119717)\/","rank":60,"beginDate":"\/Date(1441274400000)\/","endDate":"\/Date(1441274400000)\/","totalRows":0,"warnings":"","sideeffects":"","dosage":"","anticoagulant":false,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":true,"carousel_caption":"Oral Anti Diabetic Substance Discovered","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"body_|web|http://www.bio-medicine.org/medicine-news-1/Sangamo-BioSciences-Presents-Positive-Phase-2-ZFP-Therapeutic-Data-at-ADA-2009-48136-1/|See: Bio-Medicine:__","FeedId":"6ada5638-9244-4546-afa2-bf94f485c494","category":"sol_diabetes","title":"ZFP TFTM (SB-509 i)","author":"","shortDescription":"Is This DNA-Binding Protein A Cure for Neuropathy?","description":"Published in the Journal of Diabetes the University of Manchester team has shown in clinical trials that a single injection of a novel DNA-binding protein called ZFP TFTM (SB-509 is the name assigned for clinical trials), developed by the cutting-edge biotech firm Sangamo BioSciences Inc., in diabetic patients suffering from neuropathy protected nerve function, and stimulated nerve growth and prevented tissue damage that in humans leads to limb loss.\nSangamo BioSciences, Inc. (Nasdaq: SGMO) has initiated Phase I clinical trial of SB-509, a therapeutic designed to protect and stimulate regeneration of peripheral nerve function in diabetics suffering from peripheral neuropathy.","link":"","linkType":"category","linkValue":"","image":"img_default/1_diabetes.png","publishedDate":"\/Date(1441250383000)\/","rank":60,"beginDate":"\/Date(1441188000000)\/","endDate":"\/Date(1441188000000)\/","totalRows":0,"warnings":"","sideeffects":"","dosage":"","anticoagulant":false,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":true,"carousel_caption":"Is This DNA-Binding Protein A Cure for Neuropathy?","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"body_|category|http://www.nature.com/articles/mtm201511|Cell-in-a-Box®, can be viewed in its entirety at __","FeedId":"06444f2e-0841-42b1-868f-9bdd46a57131","category":"sol_diabetes","title":"PharmaCyte Biotech\u0027s Melligen Cell Line Can Reverse Diabetes","author":"","shortDescription":"PharmaCyte Biotech\u0027s Melligen Cell Line Can Reverse Diabetes","description":"PharmaCyte Biotech, Inc. (OTCQB:PMCB) published a major research article titled \"Reversal of diabetes following transplantation of an insulin-secreting human liver cell line: Melligen cells\" in the journal Molecular Therapy – Methods \u0026 Clinical Development. This research article about their live-cell encapsulation technology. The article describes the development of the Melligen cell line and notes that it was developed from human liver cells. Numerous tests were done during the various stages of the development process and studies were carried out to show that Melligen cells secreted insulin in response to physiological concentrations of glucose (blood sugar). Furthermore, when Melligen cells were transplanted into diabetic mice whose immune systems were essentially not functioning, the blood glucose levels of the mice became normal. This observation illustrates that Melligen cells can reverse the diabetic condition. Most importantly, however, the authors of the article note that, for the Melligen cells to be effective in treating Type 1 diabetes in humans where the insulin-producing ß cells of the pancreas have been destroyed, it will be necessary to protect those cells from rejection by the body\u0027s immune system after they have been introduced into the body. The article points out that one way to protect the Melligen cells would be to encapsulate the cells in protective \"cocoons\" prior to being placed into a diabetic patient. If this is done, the authors believe that encapsulated Melligen cells may offer a cure for Type 1 diabetes.","link":"","linkType":"category","linkValue":null,"image":"img_default/1_diabetes.png","publishedDate":"\/Date(1441239546683)\/","rank":60,"beginDate":"\/Date(1441177200000)\/","endDate":"\/Date(1441177200000)\/","totalRows":0,"warnings":null,"sideeffects":null,"dosage":"","anticoagulant":false,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":null,"state":null,"postalCode":null,"country":null,"areaCode":null,"closed":false,"carousel":true,"carousel_caption":"PharmaCyte Biotech\u0027s Melligen Cell Line Can Reverse Diabetes","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"}]
