[{"bodyLinks":"body_|web|http://www.ncbi.nlm.nih.gov/pmc/articles/PMC4369655/table/T2/|HUMAN CLINICAL STUDIES: __body_|web|http://cancerres.aacrjournals.org/content/70/7/2613.full.pdf|BEST ARTICLES:__body_|web|http://jnci.oxfordjournals.org/content/107/7/djv085.short|__body_|web|http://www.ncbi.nlm.nih.gov/pmc/articles/PMC4369655|__","FeedId":"b8dc3803-0ce4-4a47-9d84-e276e89a789f","category":"sol_cancer","title":"4-Methylumbelliferone","author":"400 mg TID","shortDescription":"4-Methylumbelliferone (4-MU or Cantabiline) in one study \u003cb\u003e4-MU\u003c/b\u003e inhibited prostate cancer and bone metastasis in \u003cb\u003e100%\u003c/b\u003e of subjects. Even after stopping treatment, no bone metastases developed. Used in Germany in 1930s to treat metastatic prostate cancer successfully. In recent declassified documents that were originally seized in \u003cb\u003e\u003ci\u003eOperation Paper Clip\u003c/i\u003e\u003c/b\u003e at the end of World War II, studies by German doctors on German Military Officers and prisoners in concentration camps showed a complete reversal of metastatic prostate cancer.","description":"4-Methylumbelliferone (4-MU or Cantabiline) in\u0026nbsp;one study \u003cb\u003e4-MU\u003c/b\u003e inhibited prostate cancer and bone metastasis in \u003cb\u003e100%\u003c/b\u003e subjects. Even after stopping treatment, no bone metastases developed. Used in Germany in 1930s to treat metastatic prostate cancer successfully. In recent declassified documents that were originally seized in \u003cb\u003e\u003ci\u003eOperation Paper Clip\u003c/i\u003e\u003c/b\u003e at the end of World War II, studies by German doctors on German Military Officers and prisoners in concentration camps showed a complete reversal of metastatic prostate cancer. \u0026nbsp;Targets PCa metastasis by abrogating HA signaling and hyaluronic acid synthesis. Prevent onset of Type 1 diabetes if initiated before insulin-producing beta cells are attacked.\u003cbr\u003e","link":"","linkType":"category","linkValue":"","image":"img_default/1_cancer.png","publishedDate":"\/Date(1441547722960)\/","rank":100,"beginDate":"\/Date(1441512000000)\/","endDate":"\/Date(1441512000000)\/","totalRows":0,"warnings":"","sideeffects":"","dosage":"400 mg 3x day","anticoagulant":false,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":true,"carousel_caption":"The supplement 4-MU blocks metastasis of prostate cancer","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"","FeedId":"55c5179c-7558-4cbb-a79c-7884633055b3","category":"sol_cancer","title":"PSK and PSP","author":"","shortDescription":"Polysaccharide peptide (PSP) and polysaccharide-K (PSK) show very strong promise in fightning tumor growth as well as boost the immune system.","description":"\u003cdiv\u003e\u003cdiv\u003ePolysaccharide peptide (PSP) and polysaccharide-K (PSK) show very strong promise in fightning tumor growth as well as boost the immune system.\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eTaking polysaccharide krestin (PSK), a substance found in Coriolus mushroom, by mouth may improve some the response to chemotherapy in people with various cancers. PSK has been used in Japan for several decades for breast cancer, esophageal cancer, gastric cancer, lung cancer, hepatic cancer, colorectal cancer, and nasopharyngeal cancer.\u0026nbsp;\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003ePolysaccharide peptide (PSP) comes from a type of mushroom called \"Turkey Tail,\" is 100 percent effective at targeting prostate cancer stem cells and suppressing tumor formation. The research, which has been published in the online journal PLoS ONE, represents the first to show that a natural substance is totally and completely effective in every single trial. For the study, Dr. Patrick Ling, senior researcher from the Australian Prostate Cancer Research Centre in Queensland and the Institute for Biomedical Health \u0026amp; Innovation (IHBI) at QUT, and his colleagues fed PSP for 20 weeks to mice with prostate cancer. Compared to another group of prostate cancer mice not given PSP, which subsequently developed prostate tumors, the PSP group remained completely free of tumors.\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003eSee:\u003ca href=\"http://www.naturalnews.com/032574_Turkey_Tail_cancer.html#ixzz4RPfAyjQ1\"\u003e http://www.naturalnews.com/032574_Turkey_Tail_cancer.html#ixzz4RPfAyjQ1\u003c/a\u003e\u003c/div\u003e","link":"","linkType":"category","linkValue":"","image":"img_default/1_cancer.png","publishedDate":"\/Date(1480495966900)\/","rank":99,"beginDate":"\/Date(1480495966900)\/","endDate":"\/Date(1480495966900)\/","totalRows":0,"warnings":"PSK (which is extracted from coriolus mushroom) have experienced nausea, low white blood cell counts, and liver problems.\u0026nbsp;","sideeffects":"","dosage":"","anticoagulant":true,"carcinogenic":false,"hypoglycemic":false,"liverdamage":true,"kidneydamage":true,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":false,"carousel_caption":"","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"","FeedId":"7573b854-5069-42ae-a825-21d568ec3828","category":"sol_cancer","title":"Pterostilbene","author":"","shortDescription":"Pterostilbene (trans-3,5-dimethoxy-4-hydroxystilbene) , an over-the-counter supplement suppresses prostate cancer irrespective of androgen status. Inhibits MTA1 associated with prostate cancer aggressiveness. Increases p53 tumor suppressor in breast and prostate cancer. extremely effective against resistant bladder cancer.","description":"Low doses of pterostilbene (10mg or less) seem to improve cognition. But as with many drugs, higher doses don\u0027t seem to have any neurological benefits and may interfere with cognition. Higher dosages (150mg range) seem to have benefit for reducing cholesterol and glucose in research animals. The reduction in blood glucose and improvement in insulin sensitivity is quite potent, with a few studies noting that it is comparable to metformin as the reference drug.But in some individuals higher dosages may interfere with cognition.\u003cbr\u003e\u003cbr\u003eFor prostate cancer see:\u003cbr\u003e\u003ca href=\"http://digitalcommons.pcom.edu/cgi/viewcontent.cgi?article=1089\u0026amp;context=biomed\"\u003ehttp://digitalcommons.pcom.edu/cgi/viewcontent.cgi?article=1089\u0026amp;context=biomed\u003c/a\u003e\u003cbr\u003e\u003cbr\u003eMost effective inhibitor of MTA1 associated with prostate cancer aggressiveness. Increases p53 tumor suppressor in breast and prostate cancer.  Extremely effective against chemoresistant bladder cancer. Pterostilbene-Isothiocyanate Suppresses Prostate Cancer Irrespective of Androgen Receptor Status.  Improves cognition, reduces cholesterol. Extremely potent in increasing insulin sensitivity, as effective as metformin in reduce blood glucose. Ani-coagulant properties.\nBecause high doses of pterostilbene may lower blood glucose and blood pressure, consult your healthcare provider before taking this product if you are taking blood glucose or blood pressure lowering medication.\nA study used acetaminophen, which is the active ingredient in Tylenol, and gave an overdose to rats in order to induce hepatoxicity (chemically induced liver damage).\nIn combination with silymarin (milk thistle seed extract), the pterostilbene at a dosage of 50 mg per kilogram of body weight was given for 15 days leading up to when the acetaminophen was used. It was found to have protective properties which were attributed to its “antioxidant, anti-inflammatory, and antiapoptotic actions” (15).","link":"","linkType":"category","linkValue":"","image":"img_default/1_cancer.png","publishedDate":"\/Date(1476405333040)\/","rank":99,"beginDate":"\/Date(1476405333040)\/","endDate":"\/Date(1476405333040)\/","totalRows":0,"warnings":"One potentially dangerous side effect seen and that was, as previously mentioned, an increase in LDL “bad” cholesterol. \nLow doses of pterostilbene (10mg or less) seem to improve cognition. But as with many drugs, higher doses don\u0027t seem to have any neurological benefits and may interfere with cognition. Higher dosages (150mg range) seem to have benefit for reducing cholesterol and glucose in research animals. The reduction in blood glucose and improvement in insulin sensitivity is quite potent, with a few studies noting that it is comparable to metformin as the reference drug.But in some individuals higher dosages may interfere with cognition.\nBecause high doses of pterostilbene may lower blood glucose and blood pressure, consult your healthcare provider before taking this product if you are taking blood glucose or blood pressure lowering medication.","sideeffects":"","dosage":"50 mg 3x day","anticoagulant":true,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":true,"carousel_caption":"","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"","FeedId":"8592dd7d-d243-449d-b87d-db481e59431d","category":"sol_cancer","title":"Isosilybin B","author":"","shortDescription":"Scientists recently uncovered Isosilybin B, a novel component of over-the-counter supplement, milk thistle, that is active against both hormone-dependent and hormone-independent prostate cancers. Anti-tumor action in bladder and prostate cancer.\u0026nbsp;","description":"Blocks Androgen receptors through a different mechanism than drugs like Casodex (Bicalutamide) and unlike Casodex may NOT stop working after extended use.\u0026nbsp;Milk thistle contains Isosilybin B which is beneficial as well as hundreds of other chemicals which are NOT beneficial and may even be very harmful. Only Isosilybin B in Milk Thistle has been found to have anti-tumor action in bladder and prostate cancer cells. The Isosilybin B found in milk thistle can increase the bile solubility, which promote its flow. This can be very helpful when you want to prevent or treat gall stones. If the bile has an improved flow, it is less likely for the gallstone to form. Researches prove that regular usage of milk thistle can cause a noticeable reduction of cholesterol level in the bile.\u003cbr\u003eMost relevant studies include:\u003cbr\u003e\u003ca href=\"https://www.ncbi.nlm.nih.gov/pubmed/9081370?dopt=Abstract\"\u003ehttps://www.ncbi.nlm.nih.gov/pubmed/9081370?dopt=Abstract\u003c/a\u003e\u003cbr\u003eand\u003cbr\u003e\u003ca href=\"http://www.sciencedirect.com/science/article/pii/S1065699508003843\"\u003ehttp://www.sciencedirect.com/science/article/pii/S1065699508003843\u003c/a\u003e\u003cbr\u003eand\u003cbr\u003e\u003ca href=\"http://www.cancerletters.info/article/S0304-3835(99)00276-1/abstract\"\u003ehttp://www.cancerletters.info/article/S0304-3835(99)00276-1/abstract\u003c/a\u003e\u003cbr\u003eand\u003cbr\u003e\u003ca href=\"http://www.cancerletters.info/article/S0304-3835(99)00276-1/abstract\"\u003ehttp://www.cancerletters.info/article/S0304-3835(99)00276-1/abstract\u003c/a\u003e\u003cbr\u003eand\u003cbr\u003e\u003ca href=\"http://www.journalofsurgicalresearch.com/article/S0022-4804(07)00241-7/abstract\"\u003ehttp://www.journalofsurgicalresearch.com/article/S0022-4804(07)00241-7/abstract\u003c/a\u003e\u003cbr\u003eand\u003cbr\u003e\u003ca href=\"https://www.sciencedaily.com/releases/2011/11/111115145236.htm\"\u003ehttps://www.sciencedaily.com/releases/2011/11/111115145236.htm\u003c/a\u003e\u003cbr\u003eand\u003cbr\u003e\u003ca href=\"http://www.eurekaselect.com/76072/article\"\u003ehttp://www.eurekaselect.com/76072/article\u003c/a\u003e\u003cbr\u003eand\u003cbr\u003e\u003ca href=\"http://www.coloradocancerblogs.org/silibinin-found-in-milk-thistle-protects-against-uv-induced-skin-cancer/\"\u003ehttp://www.coloradocancerblogs.org/silibinin-found-in-milk-thistle-protects-against-uv-induced-skin-cancer/\u003c/a\u003e\u003cbr\u003eand\u003cbr\u003e\u003ca href=\"http://www.nature.com/onc/journal/v27/n28/full/onc200845a.html\"\u003ehttp://www.nature.com/onc/journal/v27/n28/full/onc200845a.html\u003c/a\u003e\u003cbr\u003e\u003cbr\u003e\u003cbr\u003e","link":"","linkType":"category","linkValue":"","image":"img_default/1_cancer.png","publishedDate":"\/Date(1442514050640)\/","rank":99,"beginDate":"\/Date(1442473200000)\/","endDate":"\/Date(1442473200000)\/","totalRows":0,"warnings":"\u003cb\u003eMen with Prostate Cancer must be very careful \u003c/b\u003ebefore taking silybin B, or isosilybin B since all the studies we saw did \u003cb\u003eNOT \u003c/b\u003euse any of the common Milk Thistle Supplements but instead used highly purified samples of silybin B and isosilybin B (purity between 98 and 100%) purified from silymarin. Milk Thistle Supplements currently sold are highly impure containing compounds which may have strong estrogen properties which may result in making certain hormone-sensitive cancers like prostate cancer worse. It would be nice to see synthetic silybin B and isosilybin B made available as supplements.\u003cbr\u003eSecretes hormone Prolactin which produces milk in the breasts of both men and women and may also cause breast enlargement in both women and men. Make sure that the source of Isosilybin B is from the SEED EXTRACT because many Milk Thistle supplements on the market may NOT be safe to consume if they contain LESS than 60 mg of Isosilybin B per dose. Remember that only Isosilybin B is effective. Lowers blood sugar. Acts like estrogen so \u003cb\u003eDO NOT USE\u003c/b\u003e if you have hormone-sensitive conditions such as breast cancer, uterine cancer, ovarian cancer, endometriosis, or uterine fibroids: The more commonly used milk thistle SEED extracts do not seem to act like estrogen.\u003cbr\u003eSide effects include Diarrhea, nausea, bloating, gas, upset stomach. Drug interactions are possible with milk thistle extracts. As with all polyphenol flavanoid compounds, silymarin is metabolized by the liver enzyme “Cytochrome P-450” which also is responsible for metabolizing many pharmacologic drugs. Taking silymarin along with any of those drugs may increase the toxicity of those drugs. Studies show, however, that the dose of milk thistle extract that inhibits Cytochrome P-450 is high and not likely able to be achieved with oral intake. One exception was recently identified with a potential interaction with the blood thinner, warfarin (milk thistle extract slowed the metabolism of warfarin, increasing the risk of bleeding.) If you have an allergy to ragweed, chrysanthemums, marigolds, or daisies, you should avoid milk thistle. Milk thistle may cause a rash or lead to severe allergic reaction. Since milk thistle may mimic the effects of estrogen, some women should avoid this herb. This includes women who have fibroid tumors or endometriosis. Additionally, women with breast, uterine, and ovarian cancers should not take milk thistle.\u003cbr\u003e\u003cbr\u003e","sideeffects":"","dosage":"60 mg 3x day","anticoagulant":true,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":true,"carousel_caption":"Isosilybin B seems to be a powerful new weapon for treating prostate cancer","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"body_|web|http://preventcancer.aicr.org/site/News2?abbr=res_\u0026id=7689|See Studies:__","FeedId":"eb7ffbea-3086-4db0-ba43-84fc3a81e66e","category":"sol_cancer","title":"EGCG","author":"325 mg  QD","shortDescription":"EGCG, Epigallocatechin-3-gallate, Blocks Most Forms of Cancer, has been shown to help prevent and treat a wide variety of cancers, including Colon cancer, Breast cancer, Prostate cancer, Lung cancer, Ovarian cancer, Hepatoma, Bladder cancer, Leukemia, Myeloma, and Melanoma.","description":"EGCG is the most important component of green tea to the prostate cancer patient. The first evidence of its ability to induce prostate cancer apoptosis (programmed cell death) was published in Cancer Letters back in 1998 (130(1-2):1-7 1998 Aug 14). EGCG was shown to inhibit growth and induce regression of human prostate and breast cancers in athymic mice.\nInt J Cancer. 2005 Feb 10;113(4):660-9. Green tea constituent epigallocatechin-3-gallate selectively inhibits COX-2 without affecting COX-1 expression in human prostate carcinoma cells. Overexpression of cyclooxygenase (COX)-2 has been implicated in many pathologic conditions, including cancer. One practical inference of this finding is that sustained inhibition of COX-2 could serve as a promising target for prevention or therapy of cancer. Conventional nonsteroidal antiinflammatory drugs (NSAIDs) and recently developed COX-2-specific inhibitors have shown considerable promise in prevention of some forms of human cancer; however, its application is limited due to severe toxic side effects on normal cells. Therefore, there is a need to define novel, nontoxic dietary constituents with proven chemopreventive effects through other pathways that also possess COX-2 but not COX-1 inhibitory activity. Recent studies on green tea and its major polyphenolic constituent (-)epigallocatechin-3-gallate (EGCG) have established its remarkable cancer preventive and some cancer therapeutic effects. Here, we show that EGCG inhibits COX-2 without affecting COX-1 expression at both the mRNA and protein levels, in androgen-sensitive LNCaP and androgen-insensitive PC-3 human prostate carcinoma cells. Based on our study, it is tempting to suggest that a combination of EGCG with chemotherapeutic drugs could be an improved strategy for prevention and treatment of prostate cancer.","link":"","linkType":"category","linkValue":"","image":"img_default/1_cancer.png","publishedDate":"\/Date(1442407168260)\/","rank":99,"beginDate":"\/Date(1442365200000)\/","endDate":"\/Date(1442365200000)\/","totalRows":0,"warnings":"","sideeffects":"","dosage":"325 mg  1x day","anticoagulant":true,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":true,"carousel_caption":"EGCG has been shown to help prevent and treat a wide variety of cancers","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"","FeedId":"21fdcea8-bf2b-4ad9-9536-49e873a8a0fb","category":"sol_cancer","title":"CoQ10","author":"","shortDescription":"CoQ 10 can suppress cancer cell growth but the mechanisms involved are not known.","description":"\u003cdiv\u003eCoQ 10 can suppress cancer cell growth but the mechanisms involved are not known.\u003c/div\u003e\u003cdiv\u003eSee:\u003c/div\u003e\u003cdiv\u003e\u003ca href=\"http://www.ncbi.nlm.nih.gov/pubmed/4218125?dopt=Abstract\"\u003ehttp://www.ncbi.nlm.nih.gov/pubmed/4218125?dopt=Abstract\u003c/a\u003e\u003c/div\u003e\u003cdiv\u003eand\u003c/div\u003e\u003cdiv\u003e\u003ca href=\"http://www.ncbi.nlm.nih.gov/pubmed/653103?dopt=Abstract\"\u003ehttp://www.ncbi.nlm.nih.gov/pubmed/653103?dopt=Abstract\u003c/a\u003e\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eCoQ 10 stimulates the immune system.\u0026nbsp;\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eSee:\u003c/div\u003e\u003cdiv\u003e\u003ca href=\"http://www.ncbi.nlm.nih.gov/pubmed/1673841?dopt=Abstract\"\u003ehttp://www.ncbi.nlm.nih.gov/pubmed/1673841?dopt=Abstract\u003c/a\u003e\u003c/div\u003e\u003cdiv\u003eand\u003c/div\u003e\u003cdiv\u003e\u003ca href=\"http://www.ncbi.nlm.nih.gov/pubmed/10416052?dopt=Abstract\"\u003ehttp://www.ncbi.nlm.nih.gov/pubmed/10416052?dopt=Abstract\u003c/a\u003e\u003c/div\u003e\u003cdiv\u003eand\u003c/div\u003e\u003cdiv\u003e\u003ca href=\"http://www.ncbi.nlm.nih.gov/pubmed/101414?dopt=Abstract\"\u003ehttp://www.ncbi.nlm.nih.gov/pubmed/101414?dopt=Abstract\u003c/a\u003e\u003c/div\u003e\u003cdiv\u003eand\u003c/div\u003e\u003cdiv\u003e\u003ca href=\"http://www.ncbi.nlm.nih.gov/pubmed/5478631?dopt=Abstract\"\u003ehttp://www.ncbi.nlm.nih.gov/pubmed/5478631?dopt=Abstract\u003c/a\u003e\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eCoQ 10 blood levels correlate with the risk of developing melanoma and it enhances the efficacy of interferon therapy for melanoma.\u003c/div\u003e\u003cdiv\u003eSee:\u003c/div\u003e\u003cdiv\u003e\u003ca href=\"http://www.ncbi.nlm.nih.gov/pubmed/16443053\"\u003ehttp://www.ncbi.nlm.nih.gov/pubmed/16443053\u003c/a\u003e\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e","link":"","linkType":"category","linkValue":"","image":"img_default/1_cancer.png","publishedDate":"\/Date(1480423289367)\/","rank":98,"beginDate":"\/Date(1480423289367)\/","endDate":"\/Date(1480423289367)\/","totalRows":0,"warnings":"Don’t take CoQ 10 during radiation therapy. Side effects include mild insomnia, elevated liver enzymes, rashes, nausea, upper abdominal pain/heartburn, dizziness, sensitivity to light, irritability, headache, and fatigue. Unlike most supplements, CoQ 10 is a COAGULANT increasing the ability of blood to clot and CoQ 10 may reduce the efficacy of warfarin and other anti-coagulants. CoQ 10 may reduce insulin requirements in diabetics.","sideeffects":"","dosage":"100 to 200 mg 1x day","anticoagulant":false,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":false,"carousel_caption":"","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"","FeedId":"6ee3bcd2-be47-4e4e-b018-163c84c4da59","category":"sol_cancer","title":"Boswellia (AprèsFlex®)","author":"","shortDescription":"Studies show this may be effective against prostate cancer. Best extract of Boswellia is AprèsFlex® (Boswellia serrata) Extract. A compound in boswellia called AKBA (3-O-acetyl-11-keto-ß-boswellic acid) blocks 5-lipoxygenase (5-LOX).","description":"Studies show this may be effective against prostate cancer. Best extract of Boswellia is AprèsFlex® (Boswellia serrata) Extract. A compound in boswellia called AKBA (3-O-acetyl-11-keto-ß-boswellic acid) blocks 5-lipoxygenase (5-LOX). Studies show this may be effective against prostate cancer. Best extract of Boswellia is AprèsFlex® (Boswellia serrata) Extract. A compound in boswellia called AKBA (3-O-acetyl-11-keto-ß-boswellic acid) blocks 5-lipoxygenase (5-LOX).","link":"","linkType":"category","linkValue":"","image":"img_default/1_cancer.png","publishedDate":"\/Date(1476696515977)\/","rank":98,"beginDate":"\/Date(1476696515977)\/","endDate":"\/Date(1476696515977)\/","totalRows":0,"warnings":"Can cause nausea, vomiting, headache, skin rash, and abdominal pain.","sideeffects":"","dosage":"100 mg 1x day","anticoagulant":true,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":false,"carousel_caption":"","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"","FeedId":"dafed257-8923-4f44-a4fe-763341efea9b","category":"sol_cancer","title":"Curcumin (CurQlife®)","author":"400 mg BID","shortDescription":"Inhibits STAT3 \u0026 NF-?B which play key-roles in cancer. Suppresses Sp-1 in colorectal, bladder and lung carcinoma. Effective in osteoarthritis, inflammation, certain skin diseases, Alzheimer\u0027s, colitis, stomach ulcers, high cholesterol, scabies, diabetes, HIV, uveitis, and viral infections.","description":"Inhibits STAT3 \u0026 NF-?B which play key-roles in cancer. Suppresses Sp-1 in colorectal, bladder and lung carcinoma. Effective in osteoarthritis, inflammation, certain skin diseases, Alzheimer\u0027s, colitis, stomach ulcers, high cholesterol, scabies, diabetes, HIV, uveitis, and viral infections. Decreases Blood Sugar, heartburn, diarrhea, vomiting, dark, tarry or bloody stools. Increases flow of bile and washes gallstones out of gallbladder to cause obstruction in bile duct.","link":"","linkType":"category","linkValue":"","image":"img_default/1_cancer.png","publishedDate":"\/Date(1476311129270)\/","rank":98,"beginDate":"\/Date(1476311129270)\/","endDate":"\/Date(1476311129270)\/","totalRows":0,"warnings":"Anti-coagulant and causes contraction of Gallbladder.","sideeffects":"","dosage":"400 mg 2xday","anticoagulant":true,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":false,"carousel_caption":"","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"","FeedId":"fa6167a6-aa25-499c-9334-67e3aa4f8db2","category":"sol_cancer","title":"Vitamin D3","author":"4000 IU QD","shortDescription":"Preliminary results from a recent study indicate that many of the men who received vitamin D showed improvements in their prostate tumors, whereas the tumors in the placebo group either stayed the same or got worse.","description":"Hollis wondered if giving these men vitamin D supplements during the 60-day waiting period would affect their prostate cancer. His previous research had shown that when men with low-grade prostate cancer took vitamin D supplements for a year, 55 percent of them showed decreased Gleason scores or even complete disappearance of their tumors compared to their biopsies a year before (J. Clin. Endocrinol. Metab., 2012, DOI: 10.1210/jc.2012-1451). In a new randomized, controlled clinical trial, his team assigned 37 men undergoing elective prostatectomies either to a group that received 4,000 U of vitamin D per day, or to a placebo group that didn\u0027t receive vitamin D. The men\u0027s prostate glands were removed and examined 60 days later. Preliminary results from this study indicate that many of the men who received vitamin D showed improvements in their prostate tumors, whereas the tumors in the placebo group either stayed the same or got worse. Also, vitamin D caused dramatic changes in the expression levels of many cell lipids and proteins, particularly those involved in inflammation. \"Cancer is associated with inflammation, especially in the prostate gland,\" says Hollis. \"Vitamin D is really fighting this inflammation within the gland.\"","link":"","linkType":"category","linkValue":"","image":"img_default/1_cancer.png","publishedDate":"\/Date(1442432106297)\/","rank":98,"beginDate":"\/Date(1442386800000)\/","endDate":"\/Date(1442386800000)\/","totalRows":0,"warnings":"Vitamin D is LIKELY SAFE when taken by mouth or given as a shot into the muscle in recommended amounts. Most people do not commonly experience side effects with vitamin D, unless too much is taken. Some side effects of taking too much vitamin D inclu","sideeffects":"","dosage":"4000 IU 1xday","anticoagulant":false,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":true,"carousel_caption":"Vitamin D Effective in Multiple Cancers","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"","FeedId":"f9b766ac-12d2-4076-b6db-f80ad1e1b64e","category":"sol_cancer","title":"Arecoline","author":"","shortDescription":"Arecoline—the stimulant component of areca nuts—has anticancer properties, researchers at Winship Cancer Institute of Emory University have discovered. The findings are scheduled for publication in Molecular Cell. Areca nuts are chewed for their stimulant effects in many Asian countries, and evidence links the practice to the development of oral and esophageal cancer. Analogous to nicotine, arecoline was identified as an inhibitor of the enzyme ACAT1, which contributes to the metabolism-distorting Warburg effect in cancer cells.","description":"Arecoline—the stimulant component of areca nuts—has anticancer properties, researchers at Winship Cancer Institute of Emory University have discovered. The findings are scheduled for publication in Molecular Cell. Areca nuts are chewed for their stimulant effects in many Asian countries, and evidence links the practice to the development of oral and esophageal cancer. Analogous to nicotine, arecoline was identified as an inhibitor of the enzyme ACAT1, which contributes to the metabolism-distorting Warburg effect in cancer cells.","link":"","linkType":"category","linkValue":"","image":"img_default/1_cancer.png","publishedDate":"\/Date(1480334748483)\/","rank":96,"beginDate":"\/Date(1480334748483)\/","endDate":"\/Date(1480334748483)\/","totalRows":0,"warnings":"Arecoline could be compared to arsenic, a form of which is used as a treatment for acute promyelocytic leukemia, but is also linked to several types of cancer. Further studies are required since it is suspected that Arecoline may has some serious side effects. DO NOT TAKE AT THIS TIME UNTIL FURTHER RESEARCH SHOWS IT TO BE SAFE.","sideeffects":"","dosage":"","anticoagulant":false,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":false,"carousel_caption":"","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"","FeedId":"8ca149e0-79c5-4b7e-862d-501e66c45666","category":"sol_cancer","title":"Metformin","author":"","shortDescription":"Metformin is a prescription drug that has emerged as a powerful anticancer agent for diabetics that has the ability to lower circulating insulin may be particularly important for the treatment of cancers known to be associated with hyperinsulinemia, such as those of the breast and colon. Moreover, metformin may exhibit direct inhibitory effects on cancer cells by inhibiting mammalian target of rapamycin (mTOR) signaling and protein synthesis.","description":"There’s an extract of French lilac (Galega officinalis) that’s been attracting a lot of attention lately in the field of oncology. Perhaps the news of yet another “natural” cancer fighting compound is no longer a surprise to readers of this site. But would it surprise you to discover that the particular substance I’m referring to is actually a prescription medication that’s generally used to help manage diabetes? The drug in question is metformin. It’s a medication that was developed over 50 years ago and is often used to combat non-alcoholic fatty liver disease (NAFLD) and polycystic ovary syndrome (PCOS). It also supports cardiovascular health and promotes weight loss/maintenance in those with blood sugar abnormalities and metabolic disorders. It’s estimated that over 35,000,000 prescriptions for metformin were written in 2008 alone. This figure is likely to increase in the future for a few very important reasons. It’s cheaper and more effective than many of the newer medications in its class, and this is one drug that may actually help save lives.\n\nThe potential for application of metformin in oncology was first recognized in retrospective epidemiological studies of diabetic patients with cancer. Numerous observational studies reported decreased cancer incidence and cancer-related mortality in diabetics receiving standard doses of metformin (1500 to 2250 mg/day in adults). For example, Evans and colleagues reported a reduced risk of subsequent cancer diagnosis in diabetics receiving metformin (vs those patients not receiving the drug), with the protective effect increasing with greater metformin exposure. Additional studies examining all forms of cancer have reported reduced cancer risk in diabetics on metformin (vs no metformin treatment and lower cancer-related mortality in patients receiving metformin compared to those receiving other standard diabetic therapies. Furthermore, a recent epidemiological study of 2,529 women with breast cancer reported higher pathologic complete response rates (pCRs; considered a surrogate for overall survival in this setting) to neoadjuvant systemic therapy in diabetic patients receiving metformin (pCR 24%) compared to diabetic patients not receiving metformin (pCR 8%) and non-diabetic patients not receiving metformin (pCR 16%)[29]. However, despite the increase in pCR, metformin did not significantly improve the estimated 3-year relapse-free survival rate in this study. Moreover, in a similar study of diabetic prostate cancer patients, metformin use was not associated with benefit. Thus, further clinical research is needed to fully appreciate the impact of metformin on cancer recurrence and survival.\n\nWhile the majority of evidence supporting a role for metformin in the treatment of cancer has been derived from retrospective studies involving diabetics, some prospective clinical trials have been completed in non-diabetic patients. In a recent study, low doses of metformin (250 mg/day) reduced the number of rectal aberrant crypt foci (a surrogate marker for colorectal cancer) and decreased the proliferative activity of colonic epithelium in non-diabetic patients. Furthermore, interim analyses of ongoing studies involving neoadjuvant metformin treatment of newly diagnosed breast cancer patients have demonstrated that metformin is safe and well tolerated, and exhibits favorable effects on insulin metabolism and tumor cell proliferation and apoptosis.\n\nMetformin also displays significant growth inhibitory effects in several cancer cell and mouse tumor models. In cell culture, metformin inhibits the proliferation of a range of cancer cells including breast, prostate, colon, endometrial, ovarian, and glioma. The effects of metformin on cancer cell proliferation were associated with AMPK activation, reduced mammalian target of rapamycin (mTOR) signaling and protein synthesis, as well as a variety of other responses including decreased epidermal growth factor receptor (EGFR), Src, and mitogen-activated protein kinase (MAPK) activation, decreased expression of cyclins, and increased expression of p27. While not universally observed in all cells, metformin has been found to induce apoptosis in certain cell lines derived from endometrial cancers, glioma, and triple negative breast tumors.\n\nRecent studies have demonstrated that metformin may also target cancer-initiating cells. For example, metformin inhibited the growth of a subpopulation of breast cancer cells shown to have such property in culture and reduced their ability to form tumors in mice and when combined with trastuzumab, metformin reduced the cancer-initiating cell population in Her2-amplified breast cancer cells. Interestingly, metformin may also be involved in regulating breast cancer-initiating cell ontogeny by transcriptionally repressing the process of epithelial to mesenchymal transition (EMT). Metformin also reduced the growth of a variety of tumor xenografts in mice including those established from breast and prostate cancer cells, and suppressed the development of breast, colon and other tumors in transgenic mice. In addition, metformin inhibited the development of chemically induced lung tumors and preneoplastic colonic lesions in mice.","link":"","linkType":"category","linkValue":"","image":"img_default/1_cancer.png","publishedDate":"\/Date(1442381549690)\/","rank":96,"beginDate":"\/Date(1442343600000)\/","endDate":"\/Date(1442343600000)\/","totalRows":0,"warnings":"More common \u0026nbsp;Abdominal or stomach discomfort\ncough or hoarseness\ndecreased appetite\ndiarrhea\nfast or shallow breathing\nfever or chills\ngeneral feeling of discomfort\nlower back or side pain\nmuscle pain or cramping\npainful or difficult urination\nsleepiness\n\nLess common \u003cbr\u003eAnxiety\nblurred vision\nchest discomfort\ncold sweats\ncoma\nconfusion\ncool, pale skin\ndepression\ndifficult or labored breathing\ndizziness\nfast, irregular, pounding, or racing heartbeat or pulse\nfeeling of warmth\nheadache\nincreased hunger\nincreased sweating\nnausea\nnervousness\nnightmares\nredness of the face, neck, arms, and occasionally, upper chest\nseizures\nshakiness\nshortness of breath\nslurred speech\ntightness in the chest\nunusual tiredness or weakness\nwheezing\n\nRare \u003cbr\u003eBehavior change similar to being drunk\ndifficulty with concentrating\ndrowsiness\nlack or loss of strength\nrestless sleep\nunusual sleepiness","sideeffects":"","dosage":"500 mg 3x day","anticoagulant":false,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":true,"carousel_caption":"Metformin is a powerful anticancer agent for breast and colon cancers","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"body_|category|http://cam.cancer.gov/cam/attachments/MelatoninSummary.pdf|References:__","FeedId":"a916d070-68c9-4906-9237-be34a2326f49","category":"sol_cancer","title":"Melatonin","author":"","shortDescription":"The research also revealed that men who had higher levels of Melatonin\u0026nbsp;in their urine had a 75 percent decreased risk of advanced prostate cancer, compared with men with lower Melatonin\u0026nbsp;levels. Inhibits estrogen-responsive human breast cancer cells and augment the effectiveness of tamoxifen.","description":"Don\u0027t exceed 3 mg per day\nMelatonin is one of the most effective anti-cancer treatments. It inhibits cancer cell growth and proliferation; it destroys cancer cells, stops angiogenesis (new tumor blood vessel growth), and prevents harmful forms of estrogen from stimulating cancer cell growth. \n\nIn one clinical trial, patients with glioblastoma, a type of brain cancer, were given either radiation and melatonin, or radiation alone. Twenty-three percent of the patients who took the melatonin were alive after a year, while none who had received only radiation were still alive. Similarly, in another study by oncologists in Italy, patients with non-small cell lung cancers who had failed chemotherapy were given melatonin. They were compared with other patients with non-small cell lung cancers who weren\u0027t given melatonin. A year later, 26 percent of the patients who had taken melatonin were still alive; whereas, none in the non-melatonin group remained alive.\n\nMelatonin induces apoptosis, or cancer cell auto-destruction, as well as directly kills cancer cells. It also slows tumor growth through a variety of mechanisms, such as by inhibiting epidermal growth factor receptors on cancer cells. Epidermal growth factors play an important role in cancer cell growth and proliferation, so blocking their receptors on cancer cells prevents them from carrying out these roles.\nMelatonin also stimulates the immune system and increases the cancer-killing activity of macrophages, monocytes, natural killer cells, T-helper cells and eosinophils, all of which are involved in cancer cell destruction.\n\nMelatonin also inhibits angiogenesis (new tumor blood vessel creation) from existing blood vessels. Tumors get their nutrition through blood vessels, and as they grow, they require an increasingly greater supply of blood vessels to feed themselves. Preventing new blood vessel growth limits their food intake and causes them to shrink or stop growing.\n\nMelatonin has properties which enable it to block the effects of estrogen upon cancer cells; this is important because certain forms of estrogen stimulate the growth of hormonally-influenced cancers, such as breast, endometrial, ovarian and uterine cancers.","link":"","linkType":"category","linkValue":"","image":"img_default/1_cancer.png","publishedDate":"\/Date(1442361505277)\/","rank":95,"beginDate":"\/Date(1442322000000)\/","endDate":"\/Date(1442322000000)\/","totalRows":0,"warnings":"","sideeffects":"","dosage":"1 mg 1x day","anticoagulant":false,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":true,"carousel_caption":"Melatonin showed 75 percent decreased risk of prostate cancer","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"","FeedId":"399a44bf-ead2-441e-b8c8-99d45b6694e9","category":"sol_cancer","title":"African Cherry/P. Africanum","author":"","shortDescription":"P. africanum is a tree that grows in tropical zones and is used by African tribes to treat urinary symptoms and gastric pain. In the 18th century, European travelers learned from South African tribes that P. africanum could be used to treat bladder discomfort and enlarged prostate.","description":"\u003cdiv\u003eP. africanum is a tree that grows in tropical zones and is used by African tribes to treat urinary symptoms and gastric pain. In the 18th century, European travelers learned from South African tribes that P. africanum could be used to treat bladder discomfort and enlarged prostate.\u003c/div\u003e\u003cdiv\u003eBark extracts from P. africanum have been available as prescription drugs in Europe and have been widely used to treat benign prostatic hyperplasia. The bark contains a number of compounds including saturated and unsaturated fatty acids, phytosterols (e.g., beta-sitosterol), pentacyclic triterpenoids (e.g., oleanolic acid), alcohols, and carbohydrates. Two components of P. africanum bark extracts, atraric acid and N-butylbenzene-sulfonamide, are androgen receptor inhibitors, as indicated by both in vitro and animal in vivo studies..\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\n\n\u003cul style=\"text-align: left\"\u003e\n            \u003cli\u003eBrackman FG, Edgar A, Coates PM: Pygeum. In: Coates PM, Betz JM, Blackman MR, et al., eds.: Encyclopedia of Dietary Supplements. 2nd ed. New York, NY: Informa Healthcare, 2010, pp 650-5.\u003c/li\u003e\u003cli\u003e\u003cbr\u003e\u003c/li\u003e\n            \u003cli\u003eIshani A, MacDonald R, Nelson D, et al.: Pygeum africanum for the treatment of patients with benign prostatic hyperplasia: a systematic review and quantitative meta-analysis. Am J Med 109 (8): 654-64, 2000.\u0026nbsp;\u003ca href=\"http://www.ncbi.nlm.nih.gov/entrez/query.fcgi?cmd=Retrieve\u0026amp;db=PubMed\u0026amp;list_uids=11099686\u0026amp;dopt=Abstract\" style=\"box-sizing: border-box; margin: 0px; padding: 0px; border: 0px; font-style: inherit; font-variant: inherit; font-weight: inherit; font-stretch: inherit; font-size: inherit; line-height: inherit; font-family: inherit; vertical-align: baseline; color: rgb(43, 123, 186); text-decoration: none;\" title=\"http://www.ncbi.nlm.nih.gov/entrez/query.fcgi?cmd=Retrieve\u0026amp;db=PubMed\u0026amp;list_uids=11099686\u0026amp;dopt=Abstract\"\u003e[PUBMED \n                Abstract]\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003cbr\u003e\u003c/li\u003e\n            \u003cli\u003eLevin RM, Das AK: A scientific basis for the therapeutic effects of Pygeum africanum and Serenoa repens. Urol Res 28 (3): 201-9, 2000.\u0026nbsp;\u003ca href=\"http://www.ncbi.nlm.nih.gov/entrez/query.fcgi?cmd=Retrieve\u0026amp;db=PubMed\u0026amp;list_uids=10929430\u0026amp;dopt=Abstract\" style=\"box-sizing: border-box; margin: 0px; padding: 0px; border: 0px; font-style: inherit; font-variant: inherit; font-weight: inherit; font-stretch: inherit; font-size: inherit; line-height: inherit; font-family: inherit; vertical-align: baseline; color: rgb(43, 123, 186); text-decoration: none;\" title=\"http://www.ncbi.nlm.nih.gov/entrez/query.fcgi?cmd=Retrieve\u0026amp;db=PubMed\u0026amp;list_uids=10929430\u0026amp;dopt=Abstract\"\u003e[PUBMED \n                Abstract]\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003cbr\u003e\u003c/li\u003e\n            \u003cli\u003ePapaioannou M, Schleich S, Prade I, et al.: The natural compound atraric acid is an antagonist of the human androgen receptor inhibiting cellular invasiveness and prostate cancer cell growth. J Cell Mol Med 13 (8B): 2210-23, 2009.\u0026nbsp;\u003ca href=\"http://www.ncbi.nlm.nih.gov/entrez/query.fcgi?cmd=Retrieve\u0026amp;db=PubMed\u0026amp;list_uids=18627423\u0026amp;dopt=Abstract\" style=\"box-sizing: border-box; margin: 0px; padding: 0px; border: 0px; font-style: inherit; font-variant: inherit; font-weight: inherit; font-stretch: inherit; font-size: inherit; line-height: inherit; font-family: inherit; vertical-align: baseline; color: rgb(43, 123, 186); text-decoration: none;\" title=\"http://www.ncbi.nlm.nih.gov/entrez/query.fcgi?cmd=Retrieve\u0026amp;db=PubMed\u0026amp;list_uids=18627423\u0026amp;dopt=Abstract\"\u003e[PUBMED \n                Abstract]\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003cbr\u003e\u003c/li\u003e\n            \u003cli\u003ePapaioannou M, Schleich S, Roell D, et al.: NBBS isolated from Pygeum africanum bark exhibits androgen antagonistic activity, inhibits AR nuclear translocation and prostate cancer cell growth. Invest New Drugs 28 (6): 729-43, 2010.\u0026nbsp;\u003ca href=\"http://www.ncbi.nlm.nih.gov/entrez/query.fcgi?cmd=Retrieve\u0026amp;db=PubMed\u0026amp;list_uids=19771394\u0026amp;dopt=Abstract\" style=\"box-sizing: border-box; margin: 0px; padding: 0px; border: 0px; font-style: inherit; font-variant: inherit; font-weight: inherit; font-stretch: inherit; font-size: inherit; line-height: inherit; font-family: inherit; vertical-align: baseline; color: rgb(43, 123, 186); text-decoration: none;\" title=\"http://www.ncbi.nlm.nih.gov/entrez/query.fcgi?cmd=Retrieve\u0026amp;db=PubMed\u0026amp;list_uids=19771394\u0026amp;dopt=Abstract\"\u003e[PUBMED \n                Abstract]\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003cbr\u003e\u003c/li\u003e\n            \u003cli\u003eSchleich S, Papaioannou M, Baniahmad A, et al.: Extracts from Pygeum africanum and other ethnobotanical species with antiandrogenic activity. Planta Med 72 (9): 807-13, 2006.\u0026nbsp;\u003ca href=\"http://www.ncbi.nlm.nih.gov/entrez/query.fcgi?cmd=Retrieve\u0026amp;db=PubMed\u0026amp;list_uids=16783690\u0026amp;dopt=Abstract\" style=\"box-sizing: border-box; margin: 0px; padding: 0px; border: 0px; font-style: inherit; font-variant: inherit; font-weight: inherit; font-stretch: inherit; font-size: inherit; line-height: inherit; font-family: inherit; vertical-align: baseline; color: rgb(43, 123, 186); text-decoration: none;\" title=\"http://www.ncbi.nlm.nih.gov/entrez/query.fcgi?cmd=Retrieve\u0026amp;db=PubMed\u0026amp;list_uids=16783690\u0026amp;dopt=Abstract\"\u003e[PUBMED \n                Abstract]\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003cbr\u003e\u003c/li\u003e\n            \u003cli\u003eShenouda NS, Sakla MS, Newton LG, et al.: Phytosterol Pygeum africanum regulates prostate cancer in vitro and in vivo. Endocrine 31 (1): 72-81, 2007.\u0026nbsp;\u003ca href=\"http://www.ncbi.nlm.nih.gov/entrez/query.fcgi?cmd=Retrieve\u0026amp;db=PubMed\u0026amp;list_uids=17709901\u0026amp;dopt=Abstract\" style=\"box-sizing: border-box; margin: 0px; padding: 0px; border: 0px; font-style: inherit; font-variant: inherit; font-weight: inherit; font-stretch: inherit; font-size: inherit; line-height: inherit; font-family: inherit; vertical-align: baseline; color: rgb(43, 123, 186); text-decoration: none;\" title=\"http://www.ncbi.nlm.nih.gov/entrez/query.fcgi?cmd=Retrieve\u0026amp;db=PubMed\u0026amp;list_uids=17709901\u0026amp;dopt=Abstract\"\u003e[PUBMED \n                Abstract]\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003cbr\u003e\u003c/li\u003e\n            \u003cli\u003eHandratta VD, Vasaitis TS, Njar VC, et al.: Novel C-17-heteroaryl steroidal CYP17 inhibitors/antiandrogens: synthesis, in vitro biological activity, pharmacokinetics, and antitumor activity in the LAPC4 human prostate cancer xenograft model. J Med Chem 48 (8): 2972-84, 2005.\u0026nbsp;\u003ca href=\"http://www.ncbi.nlm.nih.gov/entrez/query.fcgi?cmd=Retrieve\u0026amp;db=PubMed\u0026amp;list_uids=15828836\u0026amp;dopt=Abstract\" style=\"box-sizing: border-box; margin: 0px; padding: 0px; border: 0px; font-style: inherit; font-variant: inherit; font-weight: inherit; font-stretch: inherit; font-size: inherit; line-height: inherit; font-family: inherit; vertical-align: baseline; color: rgb(43, 123, 186); text-decoration: none;\" title=\"http://www.ncbi.nlm.nih.gov/entrez/query.fcgi?cmd=Retrieve\u0026amp;db=PubMed\u0026amp;list_uids=15828836\u0026amp;dopt=Abstract\"\u003e[PUBMED \n                Abstract]\u003c/a\u003e\u003c/li\u003e\n        \u003c/ul\u003e","link":"","linkType":"category","linkValue":"","image":"img_default/1_cancer.png","publishedDate":"\/Date(1481324184580)\/","rank":94,"beginDate":"\/Date(1481324184580)\/","endDate":"\/Date(1481324184580)\/","totalRows":0,"warnings":"","sideeffects":"","dosage":"","anticoagulant":false,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":false,"carousel_caption":"","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"","FeedId":"ca142cc9-f1b7-468f-b447-739a428cb174","category":"sol_cancer","title":"Ginger Extract","author":"","shortDescription":"\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eThe British Journal of Nutrition published the results of an American study in 2012 in which ginger extract (zingiber officinale) actually killed human prostate cancer cells, while healthy prostate cells were not affected at all. Researchers found that the results occurred at a daily dose of 100 mg of ginger extract per kilogram of body weight.\u003c/div\u003e","description":"\u003cdiv\u003eThe British Journal of Nutrition published the results of an American study in 2012 in which ginger extract (zingiber officinale) actually killed human prostate cancer cells, while healthy prostate cells were not affected at all. Researchers found that the results occurred at a daily dose of 100 mg of ginger extract per kilogram of body weight.\u003c/div\u003e\u003cdiv\u003eIn eight weeks, the extract managed to reduce the prostate cancerous tumor by half. And researchers further noted that 100 grams of fresh ginger daily will offer the same results. As an anti-cancer agent, ginger produces an anti-inflammatory, antioxidant and anti-prolifeative effect on tumors, which makes this remedy a very promising preventative agent. Researchers have found that whole ginger extract contains major growth-inhibiting and death-inducing properties for a wide spectrum of cancer cells, through the interruption of cell-cycle progression that impairs the cancer reproduction process. What\u0027s more, ginger has no cell toxicity in normal, healthy cells.\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eSee: \u003ca href=\"http://www.naturalnews.com/056156_prostate_cancer_alcohol_ginger_root.html#ixzz4RPPGSnk1\"\u003ehttp://www.naturalnews.com/056156_prostate_cancer_alcohol_ginger_root.html#ixzz4RPPGSnk1\u003c/a\u003e\u003c/div\u003e","link":"","linkType":"category","linkValue":"","image":"img_default/1_cancer.png","publishedDate":"\/Date(1480502434443)\/","rank":94,"beginDate":"\/Date(1480502434443)\/","endDate":"\/Date(1480502434443)\/","totalRows":0,"warnings":"\u003cdiv\u003eThe British Journal of Nutrition published the results of an American study in 2012 in which ginger extract (zingiber officinale) actually killed human prostate cancer cells, while healthy prostate cells were not affected at all. Researchers found that the results occurred at a daily dose of 100 mg of ginger extract per kilogram of body weight.\u003c/div\u003e\u003cdiv\u003eIn eight weeks, the extract managed to reduce the prostate cancerous tumor by half. And researchers further noted that 100 grams of fresh ginger daily will offer the same results. As an anti-cancer agent, ginger produces an anti-inflammatory, antioxidant and anti-prolifeative effect on tumors, which makes this remedy a very promising preventative agent. Researchers have found that whole ginger extract contains major growth-inhibiting and death-inducing properties for a wide spectrum of cancer cells, through the interruption of cell-cycle progression that impairs the cancer reproduction process. What\u0027s more, ginger has no cell toxicity in normal, healthy cells.\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eSee:\u0026nbsp;\u003ca href=\"http://www.naturalnews.com/056156_prostate_cancer_alcohol_ginger_root.html#ixzz4RPPGSnk1\"\u003ehttp://www.naturalnews.com/056156_prostate_cancer_alcohol_ginger_root.html#ixzz4RPPGSnk1\u003c/a\u003e\u003c/div\u003e","sideeffects":"","dosage":"","anticoagulant":false,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":false,"carousel_caption":"","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"","FeedId":"3b861b5f-d4b0-456c-9d9a-a0a9aff36f5e","category":"sol_cancer","title":"Cat\u0027s Claw","author":"","shortDescription":"Named after its hook-like horns, cat\u0027s claw (Uncaria tomentosa) is a woody vine native to the Amazon rainforest and other places in South and Central America. The bark and root have been used by South Americans for centuries to treat health problems including cancer, arthritis, stomach ulcers, inflammation, dysentery, and fevers. It was also used as a form of birth control.","description":"\u003cdiv\u003eNamed after its hook-like horns, cat\u0027s claw (Uncaria tomentosa) is a woody vine native to the Amazon rainforest and other places in South and Central America. The bark and root have been used by South Americans for centuries to treat health problems including cancer, arthritis, stomach ulcers, inflammation, dysentery, and fevers. It was also used as a form of birth control.\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eTest tube studies indicate that cat\u0027s claw may stimulate the immune system, help relax the smooth muscles (such as the intestines), dilate blood vessels (helping lower blood pressure), and act as a diuretic (helping the body eliminate excess water).\u003c/div\u003e\u003cdiv\u003eThere are two versions of cat\u0027s claw bark of interest. The therapeutic effect of Una de Gato (cat\u0027s claw bark) for treating breast cancer, leukemia and lung cancer is well known in South America and well studied by Brazilian scientists.\u0026nbsp;\u003c/div\u003e\u003cdiv\u003ePeople with leukemia should NOT take cat\u0027s claw.\u003c/div\u003e","link":"","linkType":"category","linkValue":"","image":"img_default/1_cancer.png","publishedDate":"\/Date(1480472806490)\/","rank":94,"beginDate":"\/Date(1480472806490)\/","endDate":"\/Date(1480472806490)\/","totalRows":0,"warnings":"\u003cdiv\u003eMedications that suppress the immune system: In theory, because cat\u0027s claw may stimulate the immune system, it should not be used with medications that suppress the immune system. Those include cyclosporine or other medications prescribed following an organ transplant, or to treat an autoimmune disease. People with autoimmune diseases, skin grafts, tuberculosis, or those receiving organ transplants should not use cat\u0027s claw unless specifically directed by their physician because of its possible effects on the immune system.\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eBlood-thinning medications: Cat\u0027s claw may increase the risk of bleeding, especially if you also take blood thinners such as aspirin, warfarin (Coumadin), or clopidogrel (Plavix).\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eDiuretics (water pills): Cat\u0027s claw may act as a diuretic, helping the body eliminate excess fluid. If you also take diuretics, which do the same thing, you could be at risk of developing an electrolyte imbalance.\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eBlood pressure medication: Cat\u0027s claw may lower blood pressure. If you take medication for high blood pressure, taking cat\u0027s claw may cause your blood pressure to be too low. People with low blood pressure should not take cat\u0027s claw.\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003ePeople with kidney or liver disease should not use cat\u0027s claw without first asking their doctor. Other medications: Cat\u0027s claw may interfere with some medications that are processed by the liver. If you take any medications, check with your doctor before taking cat\u0027s claw.\u003c/div\u003e","sideeffects":"","dosage":"","anticoagulant":true,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":false,"carousel_caption":"","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"","FeedId":"508302d5-8051-4cc7-9493-bad4913bc8ba","category":"sol_cancer","title":"Super Berries","author":"","shortDescription":"\u003cdiv\u003eThe Super berries include Black Raspberries, Strawberries, and the Jamun Berry (or Indian Blackberry) have been found to have significant anti-cancer effects.\u003c/div\u003e","description":"\u003cdiv\u003eThe Super berries include Black Raspberries, Strawberries, and the Jamun Berry (or Indian Blackberry) have been found to have significant anti-cancer effects.\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eBlack Raspberries – Black Raspberries are NOT blackberries! The difference between the two is where the stem attaches to the berry; black raspberries are hollow in the center like raspberries while blackberries have a white core. Black raspberries are rich in anthocyanins. Recent studies from the College of Public Health at Ohio State University, Comprehensive Cancer Center in Columbus, Ohio, discovered that black raspberries prevent cervical cancer cell growth and tumor formation. Furthermore, they inhibit inflammation and induce apoptosis in esophageal and colorectal cancer tissues.\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eStrawberries – In China, 36 participants at high risk for developing esophageal cancer ate strawberries for six months and researchers found that consuming strawberries prevented esophageal lesions from developing into tumors. What a powerful berry! The volunteers drank freeze-dried strawberry powder mixed with water, since the freeze-dried process concentrates the benefits of the berries. Researcher Tong Chen discovered that 29 out of 36 participants had lesions revert from moderate to mild after six months of consuming two ounces of strawberries a day. The ellagic acid in strawberries deactivated specific carcinogens and decreased the replication of cancer cells.\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eJamun Berry (or Indian Blackberry) – These juicy purple berries of the native Indian plant, Eugenia jambolana, known as Jamun, jambolan, or black plum are available in the United States, Florida, and Hawaii. The College of Pharmacy at the University of Rhode Island analyzed the extract of Jamun berries. They found it exhibited pro-apoptotic effects against breast cancer cells but not towards normal breast cells. \u0026nbsp;\u003c/div\u003e","link":"","linkType":"category","linkValue":"","image":"img_default/1_cancer.png","publishedDate":"\/Date(1480408919150)\/","rank":94,"beginDate":"\/Date(1480408919150)\/","endDate":"\/Date(1480408919150)\/","totalRows":0,"warnings":"","sideeffects":"","dosage":"","anticoagulant":false,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":false,"carousel_caption":"","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"","FeedId":"3183de0a-346b-48d9-8193-fa5f4a41a03d","category":"sol_cancer","title":"Ellagic Acid","author":"","shortDescription":"Ellagic Acid from Red Raspberries May Be A Cure for Cancer? Studies have shown that consuming one cup of red raspberries per day (40 mg of ellagitannins) prevents the development of cancer cells","description":"DO NOT BUY ELLAGIC ACID SUPPLEMENTS--CONSUME A CUP OF RASPBERRIES A DAY. As for those products that truly contain pure ellagic acid, you don\u0027t want them because ellagic acid doesn\u0027t work as well as the complete ellagitannin complex. Although ellagic acid alone has been shown to inhibit carcinogenesis in vitro (in a test tube with isolated cancer cells), several studies have reported that the other phenolic compounds in the berries also contribute to the observed inhibitory effect. Those compounds are only present in a complete ellagitannin complex, not in a synthetic ellagic acid isolate. In other words, an ellagitannin complex works better than pure ellagic acid. Or as stated on the USDA Agricultural Research Services website: \"In pure form, ellagic acid is highly insoluble and biologically unavailable...ellagic acid, as it is biosynthesized in plants, occurs in combination with glucose as ellagitannins. These compounds are quite water soluble and biologically available. This means that relatively small amounts of ellagitannins may be more effective in the human diet than large doses of ellagic acid. What is interesting to note is the superior efficacy of eating red raspberries as opposed to taking the individual phytochemicals in the form of dietary supplements.\" Second, synthetic ellagic acid is too harsh for the human body to accept, and has some potentially serious side effects – not the least of which is its tendency to raise blood pressure. It is not practical for most people to eat a cup of Raspberries a day but it turns out the raspberry seeds have a much higher concentration of ellagitannins. Over 70% of the ellagitannins present in the Meeker red raspberry are found in the seeds. So one gram of red raspberry seed powder, taken twice a day, provides 40 mg of ellagitannins which is equivalent to the amount of ellagitannins found in one cup of fresh red raspberries. Consuming one cup of red raspberries per day (40 mg of ellagitannins) prevents the development of cancer cells. At low concentrations, it slows the growth of cancer cells; at higher concentrations, it tells cancer cells to kill themselves. For example, cells infected with the human papilloma virus (which is linked to cervical cancer), when exposed to ellagic acid experienced apoptosis, or normal cell death. Red raspberry ellagitannins slow the growth of abnormal colon cells in humans.Tests reveal similar results for breast, pancreas, esophageal, skin, and prostate cancer cells. The ellagitannins also produce a breakdown in human leukemia cells. Another way that ellagitannins protect your body is through G-Arrest. G-Arrest means that the ellagitannins stop cells from mutating in the first place. If cells don\u0027t mutate, then we don\u0027t get cancer. Red raspberry ellagitannins prevent destruction of the P53 gene by cancer cells. P53 prevents mutagenic activity in cervical cells. Red raspberry ellagitannins protect human cells against cancer-causing agents in tobacco smoke, food additives, and petroleum-based substances. Ellagitannins act as scavengers to “bind” cancer-causing chemicals, making them inactive. The ellagitannins inhibit the ability of other chemicals to cause mutations in bacteria. Red Raspberry ellagitannins also protect DNA by blocking carcinogens from binding to the DNA. European medical studies also demonstrate that red raspberry ellagitannins lower the incidence of birth defects, promote wound healing, reduce heart disease, and may reduce or reverse chemically induced liver fibrosis. In addition, the ellagic acid produced from the ellagitannins has anti-bacterial and anti-viral properties.\nDosage: 40 mg of ellagitannins(1 cup of Raspberries) qD from Raspberries OR One gram of red raspberry seed powder, taken twice a day, provides 40 mg of ellagitannins","link":"","linkType":"category","linkValue":"","image":"img_default/1_cancer.png","publishedDate":"\/Date(1442367899557)\/","rank":94,"beginDate":"\/Date(1442322000000)\/","endDate":"\/Date(1442322000000)\/","totalRows":0,"warnings":"","sideeffects":"","dosage":"40 mg 1x day","anticoagulant":false,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":true,"carousel_caption":"Studies have shown that consuming one cup of red raspberries per day (40 mg of ellagitannins) prevents the development of cancer cells","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"","FeedId":"33fb2884-54d0-44dc-ad97-b6a0d751d3be","category":"sol_cancer","title":"Flufenamic Acid","author":"","shortDescription":"An over-the-counter cold medicine, flufenamic acid, an inhibitory factor for AKR1C1, suppressed cancerous bladder cells\u0027 invasive activities and restored the effectiveness of anticancer drugs. This latest research could pave the way for medical institutions to use flufenamic acid—a much cheaper cold drug—which has unexpectedly been proven to be effective at fighting cancers.","description":"An over-the-counter cold medicine, flufenamic acid, an inhibitory factor for AKR1C1, suppressed cancerous bladder cells\u0027 invasive activities and restored the effectiveness of anticancer drugs. This latest research could pave the way for medical institutions to use flufenamic acid—a much cheaper cold drug—which has unexpectedly been proven to be effective at fighting cancers.\nCardiovascular Thrombotic Events. Nonsteroidal anti-inflammatory drugs (NSAIDs) cause an increased risk of serious cardiovascular thrombotic events, including myocardial infarction and stroke, which can be fatal. This risk may occur early in treatment and may increase with duration of use. Gastrointestinal Bleeding, Ulceration, and Perforation. NSAIDs cause an increased risk of serious gastrointestinal (GI) adverse events including bleeding, ulceration, and perforation of the stomach or intestines, which can be fatal. These events can occur at any time during use and without warning symptoms. Elderly patients and patients with a prior history of peptic ulcer disease and/or GI bleeding are at greater risk for serious GI events.\nHepatotoxicity. Elevations of ALT or AST (three or more times the upper limit of normal [ULN]) have been reported in approximately 1% of NSAID-treated patients in clinical trials. In addition, rare, sometimes fatal, cases of severe hepatic injury, including fulminant hepatitis, liver necrosis, and hepatic failure have been reported. Elevations of ALT or AST (less than three times ULN) may occur in up to 15% of patients treated with NSAIDs.","link":"","linkType":"category","linkValue":"","image":"img_default/1_cancer.png","publishedDate":"\/Date(1476822743383)\/","rank":92,"beginDate":"\/Date(1476822743383)\/","endDate":"\/Date(1476822743383)\/","totalRows":0,"warnings":"","sideeffects":"","dosage":"200 mg 1xday","anticoagulant":true,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":true,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":false,"carousel_caption":"","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"body_|embed_youtube|https://www.youtube.com/watch?v=TmvD9PP-wmA|embed_web|https://www.ncbi.nlm.nih.gov/pubmed/25662106|__","FeedId":"3e49af49-cbf0-47ef-b3b5-9004a2379a51","category":"sol_cancer","title":"Avasimibe","author":"50-500 mg QD","shortDescription":"Avasimibe selectively kills prostate cancer cells by preventing the cholesteryl ester accumulation by inhibiting desertification enzyme ACAT-1 and inducing free cholesterol related toxicity in cancer cells.","description":"Avasimibe selectively kills prostate cancer cells by preventing the cholesteryl ester accumulation by inhibiting esterification enzyme ACAT-1 and inducing free cholesterol related toxicity in cancer cells. \n\nSee: \u0026nbsp;\n\u003ca href=\"https://www.youtube.com/watch?v=TmvD9PP-wmA\" target=\"_blank\"\u003ehttps://www.youtube.com/watch?v=TmvD9PP-wmA\u003c/a\u003e  \n\u0026nbsp: AND \u0026nbsp; \n\u003ca href=\"https://www.ncbi.nlm.nih.gov/pubmed/25662106\" target=\"_blank\"\u003ehttps://www.ncbi.nlm.nih.gov/pubmed/25662106\u003c/a\u003e  \n\nClinical data are scarce, but in a study performed in 130 men and women with combined hyperlipidemia and hypoalphalipoproteinemia, avasimibe, 50-500 mg/day, significantly reduced plasma total triglyceride and VLDL-cholesterol. Although total cholesterol, LDL-cholesterol, and HDL-cholesterol were unchanged, it must be stressed that animal data suggest that avasimibe may have direct antiatherosclerotic activity in addition to its cholesterol-lowering effect. Avasimibe treatment can also contribute to increase plaque stability, as it reduces the accumulation of lipids in the arterial wall, inhibits macrophage infiltration into the media and reduces matrix metalloproteinase expression and activity.","link":"","linkType":"category","linkValue":"","image":"img_default/1_cancer.png","publishedDate":"\/Date(1476478075327)\/","rank":92,"beginDate":"\/Date(1476478075327)\/","endDate":"\/Date(1476478075327)\/","totalRows":0,"warnings":"","sideeffects":"","dosage":"50-500 mg 1xday","anticoagulant":false,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":false,"carousel_caption":"","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"","FeedId":"fd9995c4-7d2c-4df5-9ff9-ef984574e67e","category":"sol_cancer","title":"LXR-623","author":"","shortDescription":"In mouse models, LXR-623 easily crossed the blood-brain barrier to bind with LXRs in normal cells, stimulating the production of oxysterols and the reduction of cholesterol. There was no effect upon healthy neurons and other brain cells, the scientists found, but GBM cells were deprived of vital cholesterol, resulting in cell death and tumor regression.","description":"In mouse models, LXR-623 easily crossed the blood-brain barrier to bind with LXRs in normal cells, stimulating the production of oxysterols and the reduction of cholesterol. There was no effect upon healthy neurons and other brain cells, the scientists found, but GBM cells were deprived of vital cholesterol, resulting in cell death and tumor regression.\n2-[(2-chloro-4-fluorophenyl)methyl]-3-(4-fluorophenyl)-7-(trifluoromethyl)indazole","link":"","linkType":"category","linkValue":"","image":"img_default/1_cancer.png","publishedDate":"\/Date(1476452319687)\/","rank":92,"beginDate":"\/Date(1476452319687)\/","endDate":"\/Date(1476452319687)\/","totalRows":0,"warnings":"","sideeffects":"","dosage":"","anticoagulant":false,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":false,"carousel_caption":"","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"","FeedId":"f76122a6-e690-4d7d-9698-c93b92aac9b8","category":"sol_cancer","title":"Beta-Sitosterol","author":"180 mg QD","shortDescription":"\u003cdiv\u003eBeta-sitosterol is extracted from plants like Pygeum africanum, saw palmetto (Serenoa repens), and some legumes can contain rather high concentrations. Beta-sitosterol has a similar structure to cholesterol. Research has also suggested that phytosterols may have anticarcinogenic properties, but the exact mechanisms are unknown. Phytosterols may exert antitumor effects by acting on immune and hormonal systems, or by directly targeting cell cycles and inducing apoptosis in tumor cells.\u003c/div\u003e\u003cdiv\u003eBeta-sitosterol only at very high has been shown to significantly inhibit growth of PC-3 prostate cancer cells and induce apoptosis.\u003c/div\u003e\u003cdiv\u003eBeta-sitosterol is very poorly bioavailable, with an estimated 0.41% of dietary beta-sitosterol absorbed.\u003c/div\u003e","description":"\u003cdiv\u003eBeta-sitosterol is extracted from plants like Pygeum africanum, saw palmetto (Serenoa repens), and some legumes can contain rather high concentrations. Beta-sitosterol has a similar structure to cholesterol. Research has also suggested that phytosterols may have anticarcinogenic properties, but the exact mechanisms are unknown. Phytosterols may exert antitumor effects by acting on immune and hormonal systems, or by directly targeting cell cycles and inducing apoptosis in tumor cells.\u003c/div\u003e\u003cdiv\u003eBeta-sitosterol only at very high has been shown to significantly inhibit growth of PC-3 prostate cancer cells and induce apoptosis.\u003c/div\u003e\u003cdiv\u003eBeta-sitosterol is very poorly bioavailable, with an estimated 0.41% of dietary beta-sitosterol absorbed.\u003c/div\u003e","link":"","linkType":"category","linkValue":"","image":"img_default/1_cancer.png","publishedDate":"\/Date(1476567948777)\/","rank":91,"beginDate":"\/Date(1476567948777)\/","endDate":"\/Date(1476567948777)\/","totalRows":0,"warnings":"\u003cdiv\u003eA major side effect of beta-sitosterol is \u003cb\u003eerectile dysfunction (ED) and loss of interest in sex\u003c/b\u003e. Other side effects include: nausea, indigestion, gas, diarrhea, and constipation.\u0026nbsp;\u003c/div\u003e\u003cdiv\u003ePeople with Sitosterolemia, a inherited fat storage disease, have too much beta-sitosterol and related fats in their system. Taking beta-sitosterol makes this condition worse and can lead to death. Don’t take beta-sitosterol if you have sitosterolemia.\u003c/div\u003e","sideeffects":"","dosage":"60 mg to 130 mg 1xday","anticoagulant":false,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":false,"carousel_caption":"","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"","FeedId":"258c35dc-691e-4d75-be1f-68aff2bff2d2","category":"sol_cancer","title":"Aspirin","author":"80 mg QD","shortDescription":"Aspirin - Turbocharges Cancer Immunotherapy","description":"Immunotherapy promises to revolutionize cancer care by offering a better, longer-lasting response with fewer adverse side effects than conventional treatment, but the new drugs do not work well in all cases. One reason is that cancer cells often produce large amounts of the molecule prostaglandin E2 (PGE2), which turns down the immune system\u0027s normal attack response to tumor cells. Aspirin blocks PGE2 production and the researchers found that adding it to an immunotherapy treatment called anti-PD-1 substantially slowed the growth of bowel and melanoma cancers in mice when compared with treatment by immunotherapy alone. Adding aspirin or other so-called COX inhibitor drugs makes a big difference to patients getting immunotherapy. Make sure that your doctor is including aspirin in your treatments and if not, make sure he explains to you why not.","link":"","linkType":"category","linkValue":"","image":"img_default/1_cancer.png","publishedDate":"\/Date(1441462483910)\/","rank":91,"beginDate":"\/Date(1441425600000)\/","endDate":"\/Date(1441425600000)\/","totalRows":0,"warnings":"Dangerous Anti-Coagulant.","sideeffects":"","dosage":"80 mg 1xday","anticoagulant":true,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":true,"carousel_caption":"Aspirin - Turbocharges Cancer Immunotherapy","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"","FeedId":"8bfdf6bf-67ff-4864-9671-760d847403f3","category":"sol_cancer","title":"Tripterine","author":"","shortDescription":"Tripterine shows promise in prostate cancer via cell-penetrating peptide-coated nanostructured lipid carriers in a prostate cancer model.","description":"Tripterine shows promise in prostate cancer via cell-penetrating peptide-coated nanostructured lipid carriers in a prostate cancer model.","link":"","linkType":"category","linkValue":"","image":"img_default/1_cancer.png","publishedDate":"\/Date(1481284681180)\/","rank":90,"beginDate":"\/Date(1481284681180)\/","endDate":"\/Date(1481284681180)\/","totalRows":0,"warnings":"Potential anticoagulant effects are NOT known at this time so be very careful.","sideeffects":"","dosage":"","anticoagulant":false,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":false,"carousel_caption":"","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"","FeedId":"0ae71351-96cd-4e2a-8478-f9fdafea916c","category":"sol_cancer","title":"Marijuana (Cannabidiol or CBD)","author":"","shortDescription":"Marijuana (Cannabidiol or CBD) which is chemically, 2-[(1R,6R)-3-Methyl-6-prop-1-en-2-ylcyclohex-2-en-1-yl]-5-pentylbenzene-1,3-diol. When the researchers applied CBD to tumors in mice using human breast cancer cells, interaction between two cannabinoid cell receptors, CB2 and GPR55, were responsible for THC’s anti-tumor benefits.\u0026nbsp;","description":"Marijuana (Cannabidiol or CBD) which is chemically, 2-[(1R,6R)-3-Methyl-6-prop-1-en-2-ylcyclohex-2-en-1-yl]-5-pentylbenzene-1,3-diol. When the researchers applied CBD to tumors in mice using human breast cancer cells, interaction between two cannabinoid cell receptors, CB2 and GPR55, were responsible for THC’s anti-tumor benefits.\u0026nbsp;","link":"","linkType":"category","linkValue":"","image":"img_default/1_cancer.png","publishedDate":"\/Date(1480192020223)\/","rank":90,"beginDate":"\/Date(1480192020223)\/","endDate":"\/Date(1480192020223)\/","totalRows":0,"warnings":"Hundreds of studies have established adverse effects that include dizziness, tiredness, vomiting, hallucinations, memory loss, and schizophrenia in young people. A Cannabis plant includes more than 400 different chemicals, of which about 70 are cannabinoids and the vast majorityof which have never been studied for adverse effects.","sideeffects":"","dosage":"","anticoagulant":false,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":false,"carousel_caption":"","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"body_|web|http://www.ncbi.nlm.nih.gov/pubmed/25989179|See Study:__","FeedId":"21aaa4fe-18fe-4ad4-b528-f8a42918f25f","category":"sol_cancer","title":"WBM","author":"8 to 14 Grams QD","shortDescription":"White Button Mushroom Powder (WBM ) -  Agaricus Bisporus Powder Shows Amazing Potential in Prostate Cancer and in Preventing the Recurrence of Breast Cancer in Postmenopausal Breast Cancer Survivors.","description":"In a study involving 36 patients with biochemically recurrent prostate cancer with continuously rising PSA levels Przemyslaw Twardowski, M.D., from the City of Hope National Medical Center in Duarte, Calif., and colleagues examined the effects of WBM powder on serum PSA levels. The researchers observed no cases of dose-limiting toxicity. The overall response rate of PSA was 11 percent. Complete response was observed in two patients receiving 8 and 14 g/day, with declines in their PSA to undetectable levels that persisted for 49 and 30 months. Partial response was observed in two patients who received 8 and 12 g/day. Thirty-six percent of patients experienced some PSA decrease below baseline after three months of therapy. Compared with nonresponders, patients with complete and partial response had higher levels of baseline interleukin-15; therapy-associated decreases were seen in myeloid-derived suppressor cells. The conclusion was that WBM reduces PSA levels and modulate the biology of biochemically recurrent prostate cancer by decreasing immunosuppressive factors. In addition, studies have also shown that supplementation with white button mushrooms dramatically boost resistance to influenza infection and immune function in mice.","link":"","linkType":"category","linkValue":"","image":"img_default/1_cancer.png","publishedDate":"\/Date(1441471941640)\/","rank":90,"beginDate":"\/Date(1441404000000)\/","endDate":"\/Date(1441404000000)\/","totalRows":0,"warnings":"Special Precautions \u0026amp; Warnings: Pregnancy and breast-feeding: Not enough is known about the use of agaricus mushroom during pregnancy and breast-feeding. Stay on the safe side and avoid use.\n\nLiver disease: There is some concern that agaricus mushroom.\u003cbr\u003eMany people may take extracts of various species of mushrooms including \u0026nbsp;the White Button Mushroom found in the supermarket and also found to be effective in fighting prostate \u0026nbsp;Most extracts of edible mushrooms are effective in varying degrees in various cancers. However all extracts of mushroom damage the liver and kidneys to various degrees depending on the \u0026nbsp;strength, dosage and species of the mushroom. People should be very hesitant to take any mushroom extracts for any purposes whatsoever.\u003cbr\u003e","sideeffects":"","dosage":"8 to 14 Grams 1xday","anticoagulant":true,"carcinogenic":false,"hypoglycemic":false,"liverdamage":true,"kidneydamage":true,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":true,"carousel_caption":"White Button Mushroom Powder (WBM ) - Agaricus Bisporus Powder Shows Amazing Potential in Prostate Cancer and in Preventing the Recurrence of Breast C","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"body_|web|http://www.ncbi.nlm.nih.gov/pmc/articles/PMC2862133/|See Studies:__","FeedId":"80a32b14-6cd3-435d-a57c-505aafcda8fe","category":"sol_cancer","title":"Sulforaphane","author":"400 mg QD","shortDescription":"Sulforaphane, found in broccoli and Brussels sprouts, slows the growth of human breast cancer cells in the lab. It disrupts the action of protein \u0027microtubules\u0027 within the cells.","description":"Medical News Today reports that testing on mice and cell cultures has demonstrated the unique ability of sulforaphane to specifically target and kill breast cancer stem cells. This is significant because cancer treatments, such as chemotherapy and radiation, do not have the same ability. Additionally, these traditional treatments for cancer are not as effective at inhibiting cancer growth. Research also indicates that sulforaphane is able to kill cancer stem cells without damaging any other types of healthy cells in the body. If cancer stem cells are not successfully eradicated, the diseased cells maintain the ability to multiply within the body. The amount of sulforaphane used in these studies was much higher than the amount that can be obtained through food consumption. Because of the recent popularity of sulforaphane, companies are selling it in supplemental form. WebMD warns against obtaining the chemical through any means outside of regular dietary consumption, as the safety of these supplements is questionable and requires further research.","link":"","linkType":"category","linkValue":"","image":"img_default/1_cancer.png","publishedDate":"\/Date(1442386352357)\/","rank":89,"beginDate":"\/Date(1442343600000)\/","endDate":"\/Date(1442343600000)\/","totalRows":0,"warnings":"","sideeffects":"","dosage":"400 mg 1xday","anticoagulant":false,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":true,"carousel_caption":"Sulforaphane slows the growth of human breast cancer","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"","FeedId":"a623cd7c-a0bb-421d-88ad-f0638aa1a71f","category":"sol_cancer","title":"IP-6","author":"800 mg QD","shortDescription":"IP-6 has been reported to have in vivo and in vitro anticancer activity against numerous tumors, such as colon, prostate, breast, liver, chronic myeloid leukemia, and rhabdomyosarcomas.","description":"Studies suggest IP-6 can slow blood clotting but this effect has not been shown in humans. IP-6 binds with iron in the gastrointestinal (GI) tract. IP-6 binds with calcium in the gastrointestinal (GI) tract. This reduces the amount of calcium that the body absorbs from food and supplements. IP-6 might slow blood clotting so be very careful with this supplement and do NOT take it for any prolonged period of time.","link":"","linkType":"category","linkValue":"","image":"img_default/1_cancer.png","publishedDate":"\/Date(1442377755443)\/","rank":88,"beginDate":"\/Date(1442332800000)\/","endDate":"\/Date(1442332800000)\/","totalRows":0,"warnings":"May bind Calcium in the intestine.  Do NOT take it for any prolonged period of time.","sideeffects":"","dosage":"800 mg 1xday","anticoagulant":false,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":true,"carousel_caption":"IP-6 effective against colon, prostate, breast, liver, leukemia cancers","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"","FeedId":"99da1e77-e814-4330-ab60-abcc94016721","category":"sol_cancer","title":"Maitake Mushrooms","author":"300 mg BID","shortDescription":"A dose-response study showed that almost complete cancer cell death (more than 95%) was reach in just one day with higher doses of Grifron-D, i.e. beta glucan extract from Maitake.","description":"Maitake has not been studied thoroughly in humans, and its side effects are not well known. Because it has been used historically as a food, it is believed that low doses may be safe. It lowers blood pressure and lowers blood sugar significantly.  Maitake extracts may induce arthritis and allergy. Only mushroom with least potential liver damage.","link":"","linkType":"category","linkValue":"","image":"img_default/1_cancer.png","publishedDate":"\/Date(1442380686207)\/","rank":87,"beginDate":"\/Date(1442343600000)\/","endDate":"\/Date(1442343600000)\/","totalRows":0,"warnings":" it is believed that low doses may be safe. It lowers blood pressure and lowers blood sugar significantly.  Maitake extracts may induce arthritis and allergy. May cause live and kidney damage.","sideeffects":"","dosage":"300 mg 2xday","anticoagulant":true,"carcinogenic":false,"hypoglycemic":false,"liverdamage":true,"kidneydamage":true,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":true,"carousel_caption":"A dose-response study showed that almost complete cancer cell death","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"body_|category|http://www.econugenics.com/pectasol-c-modified-citrus-pectin-main/|WHERE YOU CAN BUY:__","FeedId":"97ab0ea5-466f-43d8-84ed-c2624f2961ba","category":"sol_cancer","title":"Modified Citrus Pectin","author":"5 Grams TID","shortDescription":"Some research suggests PectaSol-C® (MCP) may be protective against various types of cancer, including colon, lung, and prostate cancer. MCP may exert its anticancer effects by interfering with tumor cell metastasis or by inducing apoptosis. MCP was also shown to activate natural killer cells in leukemic cell cultures, suggesting it may be able to stimulate the immune system.","description":"In one study, MCP was well tolerated by the majority of patients. The most commonly reported side effects being pruritus, dyspepsia, and flatulence. In another study, no serious side effects from MCP were reported, although 3 patients withdrew due to abdominal cramps and diarrhea.","link":"","linkType":"category","linkValue":"","image":"img_default/1_cancer.png","publishedDate":"\/Date(1442413277483)\/","rank":81,"beginDate":"\/Date(1442376000000)\/","endDate":"\/Date(1442376000000)\/","totalRows":0,"warnings":"","sideeffects":"","dosage":"5 Grams 3xday","anticoagulant":false,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":true,"carousel_caption":"MCP may be protective against various types of cancer, including colon, lung, and prostate cancer","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"","FeedId":"5d199947-d57f-4eed-aa14-bda1a807a972","category":"sol_cancer","title":"Ursolic Acid","author":"","shortDescription":"\u003cdiv\u003eUrsolic acid is a constituent of the American cranberry (Vaccinium macrocarpon) and other Vaccinium fruit found primarily in the peel. \u0026nbsp;Studies indicate that ursolic acid can affect the cell growth behaviour of human prostate cancer cells in vitro. [Cranberry Institute (Wisconsin Board) \u0026amp; Telus MRFD Prostate Cancer Research Fund (PEI Division) funded] .\u003c/div\u003e\u003cdiv\u003e\u0026nbsp;Ursolic acid reduces prostate size and dihydrotestosterone level in a rat model of benign prostatic hyperplasia.\u003c/div\u003e\u003cdiv\u003eSee:\u0026nbsp;\u003ca href=\"https://www.ncbi.nlm.nih.gov/pubmed/22427843\"\u003ehttps://www.ncbi.nlm.nih.gov/pubmed/22427843\u003c/a\u003e\u003c/div\u003e","description":"\u003cdiv\u003eUrsolic acid is a constituent of the American cranberry (Vaccinium macrocarpon) and other Vaccinium fruit found primarily in the peel. \u0026nbsp;Studies indicate that ursolic acid can affect the cell growth behaviour of human prostate cancer cells in vitro. [Cranberry Institute (Wisconsin Board) \u0026amp; Telus MRFD Prostate Cancer Research Fund (PEI Division) funded] .\u003c/div\u003e\u003cdiv\u003e\u0026nbsp;Ursolic acid reduces prostate size and dihydrotestosterone level in a rat model of benign prostatic hyperplasia.\u003c/div\u003e\u003cdiv\u003eSee:\u0026nbsp;\u003ca href=\"https://www.ncbi.nlm.nih.gov/pubmed/22427843\"\u003ehttps://www.ncbi.nlm.nih.gov/pubmed/22427843\u003c/a\u003e\u003c/div\u003e","link":"","linkType":"category","linkValue":"","image":"img_default/1_cancer.png","publishedDate":"\/Date(1481325343430)\/","rank":80,"beginDate":"\/Date(1481325343430)\/","endDate":"\/Date(1481325343430)\/","totalRows":0,"warnings":"\u003cdiv\u003eUrsolic Acid is an anticogulant so be very careful, see:\u003c/div\u003e\u003cdiv\u003e\u003ca href=\"http://www.phytojournal.com/vol1Issue6/Issue_march_2013/14.pdf\"\u003ehttp://www.phytojournal.com/vol1Issue6/Issue_march_2013/14.pdf\u003c/a\u003e\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eUrsolic Acid (UA) and Oleanoic Acid (OA) have been generally considered to be safe and beneficial phytochemicals (Liu, 1995; Somova et al., 2003; Somova et al., 2004). Results of some experiments, together with previous reports (Lee and Han, 2003; Lee et al., 2007; Allouche et al., 2010; Messner et al., 2011), raise the question regarding cardiovascular toxicity. Only take this under the supervision of a physician.\u003c/div\u003e","sideeffects":"","dosage":"200 mg 1xday","anticoagulant":true,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":false,"carousel_caption":"","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"","FeedId":"30c342c4-0561-4ddc-9f9f-7ec691b11057","category":"sol_cancer","title":"Berberine","author":"","shortDescription":"\u003cdiv\u003eBerberine Inhibits the Metastatic Ability of Prostate Cancer Cells. Berberine is a natural alkaloid compound which is extracted as a quaternary ammonium salt from a variety of herbs in the berberis family. It is commonly used in Chinese herbal medicine and is a well-used medicinal plant in Indian Ayurvedic and Unani treatments.\u003c/div\u003e\u003cdiv\u003eSee: \u003ca href=\"http://www.medsci.org/v12p0063.htm\"\u003ehttp://www.medsci.org/v12p0063.htm\u003c/a\u003e\u003c/div\u003e","description":"\u003cdiv\u003eBerberine Inhibits the Metastatic Ability of Prostate Cancer Cells. Berberine is a natural alkaloid compound which is extracted as a quaternary ammonium salt from a variety of herbs in the berberis family. It is commonly used in Chinese herbal medicine and is a well-used medicinal plant in Indian Ayurvedic and Unani treatments.\u003c/div\u003e\u003cdiv\u003eSee:\u0026nbsp;\u003ca href=\"http://www.medsci.org/v12p0063.htm\"\u003ehttp://www.medsci.org/v12p0063.htm\u003c/a\u003e\u003c/div\u003e","link":"","linkType":"category","linkValue":"","image":"img_default/1_cancer.png","publishedDate":"\/Date(1481298001360)\/","rank":80,"beginDate":"\/Date(1481298001360)\/","endDate":"\/Date(1481298001360)\/","totalRows":0,"warnings":"\u003cdiv\u003eBerberine activates an enzyme AMPK (Adenosine Monophosphate-Activated Protein Kinase) and is normoglycemic (reduces blood sugar only if elevated) and new research shows it may make other hypoglycemics reduced blood sugar to dangerous lows.\u003c/div\u003e\u003cdiv\u003eBerberine is known to inhibit CYP2D6 and CYP3A4 (an enzyme responsible for metabolism of toxins, drugs, carcinogens, etc.) so you must use under the care of a physician to ensure other drugs and supplements you may take with it don\u0027t poison you.\u003c/div\u003e\u003cdiv\u003eBerberine inhibits the enzyme CYP3A4, a member of the Cytochrome P450 family. What that means is that berberine may decrease how fast the liver breaks down medications. Those medications then could have a longer life and potentially dangerous effects. It is similar to Grapefruit juice which has an enzyme that prevents drugs from breaking down in the body as quickly as intended, which can have fatal consequences.\u003c/div\u003e\u003cdiv\u003eBerberine should be taken with a meal to be absorbed most effectively.\u003c/div\u003e\u003cdiv\u003eA pilot study demonstrated that berberine is better than metformin in glucose magnagement.\u003c/div\u003e","sideeffects":"","dosage":"500 mg 1xday","anticoagulant":false,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":false,"carousel_caption":"","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"","FeedId":"13f8bedb-e759-42f1-aa1f-9bc48ea8135a","category":"sol_cancer","title":"Maslinic Acid","author":"","shortDescription":"Maslinic Acid inhibits colon cancer cells and A549 lung cancer cells.","description":"Maslinic Acid inhibits colon cancer cells and A549 lung cancer cells.","link":"","linkType":"category","linkValue":"","image":"img_default/1_cancer.png","publishedDate":"\/Date(1481295303997)\/","rank":80,"beginDate":"\/Date(1481295303997)\/","endDate":"\/Date(1481295303997)\/","totalRows":0,"warnings":"\u003cdiv\u003eBetulinic Acid is an anticogulant so be very careful, see:\u003c/div\u003e\u003cdiv\u003e\u003ca href=\"http://www.phytojournal.com/vol1Issue6/Issue_march_2013/14.pdf\"\u003ehttp://www.phytojournal.com/vol1Issue6/Issue_march_2013/14.pdf\u003c/a\u003e\u003c/div\u003e","sideeffects":"","dosage":"","anticoagulant":true,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":false,"carousel_caption":"","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"","FeedId":"7b2bb83f-6cd4-48cb-bd44-a81a7ca44f22","category":"sol_cancer","title":"Betulinic Acid","author":"","shortDescription":"\u003cdiv\u003eBetulinic Acid Selectively Increases Protein Degradation and Enhances Prostate Cancer-Specific Apoptosis: Possible Role for Inhibition of Deubiquitinase Activity.\u003c/div\u003e\u003cdiv\u003eSee: \u003ca href=\"http://partnecglobal.com/ds/rd/rdba/2816.pdf\"\u003ehttp://partnecglobal.com/ds/rd/rdba/2816.pdf\u003c/a\u003e\u003c/div\u003e","description":"\u003cdiv\u003eBetulinic Acid Selectively Increases Protein Degradation and Enhances Prostate Cancer-Specific Apoptosis: Possible Role for Inhibition of Deubiquitinase Activity.\u003c/div\u003e\u003cdiv\u003eSee:\u0026nbsp;\u003ca href=\"http://partnecglobal.com/ds/rd/rdba/2816.pdf\"\u003ehttp://partnecglobal.com/ds/rd/rdba/2816.pdf\u003c/a\u003e\u003c/div\u003e","link":"","linkType":"category","linkValue":"","image":"img_default/1_cancer.png","publishedDate":"\/Date(1481294785420)\/","rank":80,"beginDate":"\/Date(1481294785420)\/","endDate":"\/Date(1481294785420)\/","totalRows":0,"warnings":"\u003cdiv\u003eBetulinic Acid is an anticogulant so be very careful, see:\u003c/div\u003e\u003cdiv\u003e\u003ca href=\"http://www.phytojournal.com/vol1Issue6/Issue_march_2013/14.pdf\"\u003ehttp://www.phytojournal.com/vol1Issue6/Issue_march_2013/14.pdf\u003c/a\u003e\u003c/div\u003e","sideeffects":"","dosage":"","anticoagulant":true,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":false,"carousel_caption":"","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"","FeedId":"523db0f7-c041-46b9-95d7-5a89d12fb329","category":"sol_cancer","title":"Oleanolic Acid","author":"","shortDescription":"\u003cdiv\u003eOleanolic Acid (3ß-hydroxyolean-12-en-28-oic acid) is a pentacyclic triterpenoid compound with various pharmacological activities and a widespread occurrence throughout the plant kingdom. Oleanolic acid (OA) is a naturally occurring pentacyclic triterpenoid and possesses diverse pharmacological activities, including anti-cancer effects that have been confirmed in multiple types of human cancers.\u0026nbsp;\u003c/div\u003e\u003cdiv\u003eSee: \u003ca href=\"https://www.ncbi.nlm.nih.gov/pubmed/26687646\"\u003ehttps://www.ncbi.nlm.nih.gov/pubmed/26687646\u003c/a\u003e\u003c/div\u003e","description":"\u003cdiv\u003eOleanolic Acid (3ß-hydroxyolean-12-en-28-oic acid) is a pentacyclic triterpenoid compound with various pharmacological activities and a widespread occurrence throughout the plant kingdom. Oleanolic acid (OA) is a naturally occurring pentacyclic triterpenoid and possesses diverse pharmacological activities, including anti-cancer effects that have been confirmed in multiple types of human cancers.\u0026nbsp;\u003c/div\u003e\u003cdiv\u003eSee:\u0026nbsp;\u003ca href=\"https://www.ncbi.nlm.nih.gov/pubmed/26687646\"\u003ehttps://www.ncbi.nlm.nih.gov/pubmed/26687646\u003c/a\u003e\u003c/div\u003e","link":"","linkType":"category","linkValue":"","image":"img_default/1_cancer.png","publishedDate":"\/Date(1481283812600)\/","rank":80,"beginDate":"\/Date(1481283812600)\/","endDate":"\/Date(1481283812600)\/","totalRows":0,"warnings":"\u003cdiv\u003eOleanolic Acid is an anticogulant so be very careful, see:\u003c/div\u003e\u003cdiv\u003e\u003ca href=\"http://www.phytojournal.com/vol1Issue6/Issue_march_2013/14.pdf\"\u003ehttp://www.phytojournal.com/vol1Issue6/Issue_march_2013/14.pdf\u003c/a\u003e\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eUrsolic Acid (UA) and Oleanoic Acid (OA) have been generally considered to be safe and beneficial phytochemicals (Liu, 1995; Somova et al., 2003; Somova et al., 2004). Results of some experiments, together with previous reports (Lee and Han, 2003; Lee et al., 2007; Allouche et al., 2010; Messner et al., 2011), raise the question regarding cardiovascular toxicity. Only take this under the supervision of a physician.\u003c/div\u003e","sideeffects":"","dosage":"","anticoagulant":true,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":false,"carousel_caption":"","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"","FeedId":"c536b41d-300d-4722-b5ec-17f0900058ff","category":"sol_cancer","title":"Noni","author":"2550 mg BID","shortDescription":"Noni Morinda Citrifolia Extract contains a polysaccharide-rich substance called Noni-ppt with anti-tumor activity. AVOID THE JUICE which is very high in sugar.","description":"This review investigated the relationship of noni juice, or its extract (fruit, leaves or root), to anticancer and/or immunostimulant properties. A Medline search was conducted using the key search words \u0027Morinda citrifolia\u0027 and \u0027Morinda citrifolia and cancer\u0027 (1964 to October, 2011) along with cross-referencing. Botanical and chemical indexes were not included. A total of 304 and 29 (10%) articles, respectively, were found under these key terms. Of the 19 studies actually related to cancer, seven publications were in vitro cancer studies, nine were in vivo animal cancer studies, and three were in vivo human cancer studies. Among the in vitro studies, a \u0027concentrated component\u0027 in noni juice and not pure noni juice may stimulate the immune system to \u0027possibly\u0027 assist the body fight the cancer, and kill a small percentage (0-36%) of cancer cells depending on the type. The nine animal studies suggest that a concentrated component in noni juice may stimulate the immune system; but only slightly increases the number (about 1/3; 25-45%) of surviving mice. Other than two case studies, only two human clinical studies existed. The first consisted of testing freeze-dried noni fruit, which reduced pain perception, but did not reverse advanced cancer. The second was on smokers ingesting an unknown concentration of noni juice who experienced decreased aromatic DNA adducts, and decreased levels of plasma superoxide anion radicals and lipid hydroperoxide. Factors to consider in the future are clearly defining the substance being tested, and whether or not the juice is pasteurized. Some reports of hepatotoxicity exist, although there were confounding factors in most of the case reports. More importantly, noni juice is high in potassium and needs to be monitored by patients with kidney, liver or heart problems. In conclusion, a few in vitro and in vivo animal studies suggest a possible unidentified substance in unpasteurized noni fruit juice that may have a small degree of anticancer activity. The isolation of the active component warrants further research.","link":"","linkType":"category","linkValue":"","image":"img_default/1_cancer.png","publishedDate":"\/Date(1442388693910)\/","rank":80,"beginDate":"\/Date(1442343600000)\/","endDate":"\/Date(1442343600000)\/","totalRows":0,"warnings":"ome reports of hepatotoxicity exist, although there were confounding factors in most of the case reports. More importantly, noni juice is high in potassium and needs to be monitored by patients with kidney, liver or heart problems. In conclusion, a ","sideeffects":"","dosage":"2550 mg 2xday","anticoagulant":false,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":true,"carousel_caption":"Noni fruit juice contains a polysaccharide-rich substance called Noni-ppt with anti-tumor activity. AVOID THE JUICE which is very high in sugar.","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"","FeedId":"1edc54df-3ccd-4c88-8218-6be9451cf175","category":"sol_cancer","title":"Flaxseed \u0026 Enterolactone","author":"","shortDescription":"Enterolactone is a common chemical in Flaxseed and probably not effective in breast cancer as claimed by supplement pushers.We advise people NOT to use flaxseed unless directed to do so by a physician.","description":"Enterolactone is a common chemical in Flaxseed and probably not effective in breast cancer as claimed by supplement pushers.We advise people NOT to use flaxseed unless directed to do so by a physician.","link":"","linkType":"channel_youtube","linkValue":"","image":"img_default/1_cancer.png","publishedDate":"\/Date(1481300615450)\/","rank":70,"beginDate":"\/Date(1481300615450)\/","endDate":"\/Date(1481300615450)\/","totalRows":0,"warnings":"\u003cdiv\u003eRaw or unripe flaxseed in these forms is thought to be poisonous.\u0026nbsp;\u003c/div\u003e\u003cdiv\u003eProducts that contain partially defatted flaxseed, which is flaxseed with less alpha-linolenic acid content, are available. Some men choose these products because \u003cb\u003ealpha-linolenic acid might raise their risk of getting prostate cance\u003c/b\u003er.\u0026nbsp;\u003c/div\u003e\u003cdiv\u003eFlaxseed increases the risk of bleeding because it is an anticoagulant. Don’t use it, if you take drugs or supplements that are also anticoagulants.\u003c/div\u003e\u003cdiv\u003eFlaxseed lowers blood sugar levels and might increase the blood sugar-lowering effects of some medicines used for diabetes.\u0026nbsp;\u003c/div\u003e\u003cdiv\u003eThe high fiber content of flaxseed might make the obstruction worse.\u003c/div\u003e\u003cdiv\u003eBecause flaxseed might act like the hormone estrogen, there is some concern that flaxseed might make hormone-sensitive conditions worse. Some of these conditions include breast, uterine, and ovarian cancer; endometriosis; and uterine fibroids. However, some early laboratory and animal research suggests that flaxseed might actually oppose estrogen and might be protective against hormone-dependent cancer. Still, until more is known, avoid excessive use of flaxseed if you have a hormone-sensitive condition.\u003c/div\u003e\u003cdiv\u003eIf your triglyceride levels are too high, don’t take flaxseed.\u003c/div\u003e","sideeffects":"","dosage":"","anticoagulant":true,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":false,"carousel_caption":"","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"","FeedId":"88776935-f8c2-400c-891c-5ed660af1548","category":"sol_cancer","title":"Kaempferol","author":"","shortDescription":"Kaempferol (3,4’,5,7-tetrahydroxyflavone), is a natural polyphenol of the flavonoid family and exhibits various biological properties including anti-tumor activities. It induces apoptosis and cell cycle arrest in various cancer cell lines, including lung cancer cells (Nguyen et al., 2003), breast cancer cells (Kang et al., 2010), colon cancer cells (Li et al., 2009), besides inhibiting the migration and invasiveness of glioma cells (Shen et al., 2006). The effect of kaempferol on the growth and invasiveness of lung cancer is not yet deter-mined and the mechanism involved needs to be defined.\u0026nbsp;","description":"Kaempferol (3,4’,5,7-tetrahydroxyflavone), is a natural polyphenol of the flavonoid family and exhibits various biological properties including anti-tumor activities. It induces apoptosis and cell cycle arrest in various cancer cell lines, including lung cancer cells (Nguyen et al., 2003), breast cancer cells (Kang et al., 2010), colon cancer cells (Li et al., 2009), besides inhibiting the migration and invasiveness of glioma cells (Shen et al., 2006). The effect of kaempferol on the growth and invasiveness of lung cancer is not yet deter-mined and the mechanism involved needs to be defined.\u0026nbsp;","link":"","linkType":"channel_youtube","linkValue":"","image":"img_default/1_cancer.png","publishedDate":"\/Date(1481280095393)\/","rank":70,"beginDate":"\/Date(1481280095393)\/","endDate":"\/Date(1481280095393)\/","totalRows":0,"warnings":"This is an anticoagulant and an MAO inhibitor. WE DO NOT RECOMMEND TAKING THIS UNLESS DIRECTED TO DO BY A PHYSICIAN.","sideeffects":"","dosage":"","anticoagulant":true,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":false,"carousel_caption":"","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"","FeedId":"bf72135f-d4ac-46fc-ab0a-795a40cc5220","category":"sol_cancer","title":"Triptolide (Thunder God Vine)","author":"","shortDescription":"\u003cdiv\u003eTriptolide from Thunder God Vine (Tripteryglum wiifordii) has been reported to reduce growth of tumors in mice in a dose-dependent manner. It turns out triptolide interacts with a second pathway that involves a family of proteins called TNF (tumor necrosis factor). Although TNF can effectively kill cancer cells, it also activates an inflammation-inducing protein. The severe side effects associated with the protein make TNF a problematic treatment. However, when TNF is combined with triptolide, inflammation from the protein all but disappears, and TNF becomes even more effective at driving cancer cells to, in effect, commit suicide at low doses.\u003c/div\u003e\u003cdiv\u003eTriptolide Preserves Cognitive Function and Reduces Neuropathology in a Mouse Model of Alzheimer\u0027s Disease.\u003c/div\u003e","description":"\u003cdiv\u003eTriptolide from Thunder God Vine (Tripteryglum wiifordii) has been reported to reduce growth of tumors in mice in a dose-dependent manner. It turns out triptolide interacts with a second pathway that involves a family of proteins called TNF (tumor necrosis factor). Although TNF can effectively kill cancer cells, it also activates an inflammation-inducing protein. The severe side effects associated with the protein make TNF a problematic treatment. However, when TNF is combined with triptolide, inflammation from the protein all but disappears, and TNF becomes even more effective at driving cancer cells to, in effect, commit suicide at low doses.\u003c/div\u003e\u003cdiv\u003eTriptolide Preserves Cognitive Function and Reduces Neuropathology in a Mouse Model of Alzheimer\u0027s Disease.\u003c/div\u003e\u003cdiv\u003eIn RA trials, 60 mg/day of T2 (a chloroform-methanol extract of Tripterygium wilfordii ) for 12 weeks has been evaluated, as well as ethanol/ethyl alcohol root extract 180 to 360 mg/day. Several long-term studies have evaluated the use of 1 mg/kg/day of T2 for up to 5 years; however, adequate safety data during the same time period are limited.\u003c/div\u003e","link":"","linkType":"category","linkValue":"","image":"img_default/1_cancer.png","publishedDate":"\/Date(1481399806743)\/","rank":50,"beginDate":"\/Date(1481399806743)\/","endDate":"\/Date(1481399806743)\/","totalRows":0,"warnings":"\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eIn RA trials, 60 mg/day of T2 (a chloroform-methanol extract of Tripterygium wilfordii ) for 12 weeks has been evaluated, as well as ethanol/ethyl alcohol root extract 180 to 360 mg/day. Several long-term studies have evaluated the use of 1 mg/kg/day of T2 for up to 5 years; however, adequate safety data during the same time period are limited.\u003c/div\u003e\u003cdiv\u003eA recent systematic review of study results found therapeutic benefits, because of potential for serious side effects,should NOT be recommended as a treatment. Thundergod vine should be used with caution in persons with cardiovascular conditions, including hypertension and arrhythmias. It should also be used with caution in patients with decreased liver or kidney function. Because thundergod vine has immunomodulatory properties, it should be used with caution in immunocompromised patients as well as those with autoimmune diseases.\u0026nbsp;\u003c/div\u003e","sideeffects":"","dosage":"WARNING","anticoagulant":false,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":false,"carousel_caption":"","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"","FeedId":"2270ee03-cb12-4ec8-9777-876aa081d0dd","category":"sol_cancer","title":"Gossypol","author":"","shortDescription":"\u003cdiv\u003eAny possible anti-cancer effects are NOT impressive and not worth the serious side effects. Research suggests that taking gossypol by mouth does NOT help shrink tumors in people with advanced cancer.\u003c/div\u003e\u003cdiv\u003eGossypol causes permanent inability to father a child (sterility) with long-term use. When women take gossypol by mouth, it might be toxic to cells lining the uterus and could prevent normal function of the ovaries.\u003c/div\u003e\u003cdiv\u003eGossypol can also cause loss of energy, changes in appetite, decreased sexual desire (libido), may lower potassium levels dangerously, and cause digestive tract problems. High doses of gossypol can cause malnutrition, blood circulation problems, heart failure, changes in hair color, and other serious problems.\u003c/div\u003e","description":"\u003cdiv\u003eAny possible anti-cancer effects are NOT impressive and not worth the serious side effects. Research suggests that taking gossypol by mouth does NOT help shrink tumors in people with advanced cancer.\u003c/div\u003e\u003cdiv\u003eGossypol causes permanent inability to father a child (sterility) with long-term use. When women take gossypol by mouth, it might be toxic to cells lining the uterus and could prevent normal function of the ovaries.\u003c/div\u003e\u003cdiv\u003eGossypol can also cause loss of energy, changes in appetite, decreased sexual desire (libido), may lower potassium levels dangerously, and cause digestive tract problems. High doses of gossypol can cause malnutrition, blood circulation problems, heart failure, changes in hair color, and other serious problems.\u003c/div\u003e","link":"","linkType":"category","linkValue":"","image":"img_default/1_cancer.png","publishedDate":"\/Date(1481376186977)\/","rank":50,"beginDate":"\/Date(1481376186977)\/","endDate":"\/Date(1481376186977)\/","totalRows":0,"warnings":"\u003cdiv\u003eAny possible anti-cancer effects are NOT impressive and not worth the serious side effects.\u003c/div\u003e\u003cdiv\u003eGossypol causes permanent inability to father a child (sterility) with long-term use. When women take gossypol by mouth, it might be toxic to cells lining the uterus and could prevent normal function of the ovaries.\u003c/div\u003e\u003cdiv\u003eGossypol can also cause loss of energy, changes in appetite, decreased sexual desire (libido), may lower potassium levels dangerously, and cause digestive tract problems. High doses of gossypol can cause malnutrition, blood circulation problems, heart failure, changes in hair color, and other serious problems.\u003c/div\u003e\u003cdiv\u003eGossypol may make urinary tract irritation worse.\u0026nbsp;\u003c/div\u003e\u003cdiv\u003eCauuse severe stomach irritation.\u003c/div\u003e\u003cdiv\u003eMay cause serious heart problems.\u003c/div\u003e\u003cdiv\u003eDO NOT TAKE THIS COMPOUND UNLESS DIRECTED TO DO SO NY A PHYSICIAN.\u003c/div\u003e","sideeffects":"","dosage":"WARNING","anticoagulant":false,"carcinogenic":false,"hypoglycemic":false,"liverdamage":true,"kidneydamage":true,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":false,"carousel_caption":"","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"","FeedId":"a614cfac-1d14-4ab5-9276-2d49d6583373","category":"sol_cancer","title":"Artemisia Annua","author":"","shortDescription":"Commonly known as wormwood or sweet sagewort, Artemisia annua has been used in traditional Chinese medicine for reducing fevers, inflammation, headaches, bleeding and for treating malaria. Artemisia annua L, artemisinin and artesunate reveal profound activity against cancer in vivo and clinical trials. Common names include: Qing Hao, Sweet sagewort, Sweet wormwood, Annual wormwood.\u003cbr\u003e","description":"\u003cdiv\u003eCommonly known as wormwood or sweet sagewort, Artemisia annua has been used in traditional Chinese medicine for reducing fevers, inflammation, headaches, bleeding and for treating malaria. Artemisia annua L, artemisinin and artesunate reveal profound activity against cancer in vivo and clinical trials. Common names include: Qing Hao, Sweet sagewort, Sweet wormwood, Annual wormwood.\u003c/div\u003e\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eIn one case, a patient with prostate carcinoma (pT3bN1M1, Gleason score 8 (4+4)) presented with a prostate specific antigen (PSA) level \u0026gt;800 µg/l. After short-term treatment with bacalitumide (50 mg/d for 14 days) and long-term oral treatment with A. annua capsules (continuously 5 × 50 mg/d), the PSA level dropped down to 0.98 µg/l. MRT, scintigraphy and SPECT/CT verified tumor remission.\u0026nbsp;\u003c/div\u003e\u003cdiv\u003eLong-term treatment with A. annua capsules combined with short-term bicalitumide treatment resulted in considerable regression of advanced metastasized prostate carcinoma. HOWEVER, within a year resustence develops as well as tumor recurrence and skeletal metastases.\u003c/div\u003e\u003cdiv\u003eSee: h\u003ca href=\"ttps://www.ncbi.nlm.nih.gov/pubmed/26655404\"\u003ettps://www.ncbi.nlm.nih.gov/pubmed/26655404\u003c/a\u003e\u003c/div\u003e","link":"","linkType":"category","linkValue":"","image":"img_default/1_cancer.png","publishedDate":"\/Date(1481363218730)\/","rank":50,"beginDate":"\/Date(1481363218730)\/","endDate":"\/Date(1481363218730)\/","totalRows":0,"warnings":"\u003cdiv\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eArtemisia annua is an \u003cb\u003eanticoagulant\u003c/b\u003e.\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eArtemisia annua can Cause \u003cb\u003eSever Neurotoxicity\u003c/b\u003e\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eArtemisia can cause \u003cb\u003eseizures \u003c/b\u003eand \u003cb\u003eHepatitis\u003c/b\u003e.\u003c/div\u003e\u003cdiv\u003eNot Recommended for Long-Term Use\u003c/div\u003e\u003cdiv\u003e\u003cb\u003eTolerance/Resistance May Develop Quickly\u003c/b\u003e\u003c/div\u003e\u003cdiv\u003eNegative Side Effects Can Include Nausea, Dizziness, Fatigue\u003c/div\u003e\u003cdiv\u003eLimited Clinical Research into Anti-Cancer Effects\u003c/div\u003e\u003cdiv\u003eWE RECOMMEND YOU \u003cb\u003eDO NOT\u003c/b\u003e TAKE THIS COMPOUND.\u003cbr\u003e\u003c/div\u003e\u003cdiv\u003eRISKS OUTWEIGH VERY MINOR POTENTIAL BENEFITS.\u003c/div\u003e","sideeffects":"","dosage":"WARNING","anticoagulant":true,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":false,"carousel_caption":"","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"","FeedId":"e01d14b7-ff35-4b71-83a2-f9f6fd9e4d6b","category":"sol_cancer","title":"Withaferin A (WA)","author":"","shortDescription":"\u003cdiv\u003eWithaferin A (WA) is a compound isolated from Aswagandha plant (winter cherry) extracts used as traditional Ayurvedic Indian medicine in the treatment of fatigue and stress. In one study, researchers at the University of Louisville, isolated WA and observed that the substance inhibited the survival of several human and murine B cell lymphoma cell lines preventing them from dividing. WA targeted signaling pathways in cancer cells that are necessary for survival, such as proteins involved in stress response. Importantly, they demonstrated that WA also prevented the growth of lymphoma cells in animal models without affecting other tissues. As opposed to other chemotherapy drugs, a major advantage of WA is the effectiveness in killing cancer cells without side effects such as fatigue and pain.\u0026nbsp;\u003c/div\u003e\u003cdiv\u003eSee: \u003ca href=\"http://www.tandfonline.com/doi/pdf/10.1080/15384047.2015.1046651\"\u003ehttp://www.tandfonline.com/doi/pdf/10.1080/15384047.2015.1046651\u003c/a\u003e\u003c/div\u003e","description":"\u003cdiv\u003eWithaferin A (WA) is a compound isolated from Aswagandha plant (winter cherry) extracts used as traditional Ayurvedic Indian medicine in the treatment of fatigue and stress. In one study, researchers at the University of Louisville, isolated WA and observed that the substance inhibited the survival of several human and murine B cell lymphoma cell lines preventing them from dividing. WA targeted signaling pathways in cancer cells that are necessary for survival, such as proteins involved in stress response. Importantly, they demonstrated that WA also prevented the growth of lymphoma cells in animal models without affecting other tissues. As opposed to other chemotherapy drugs, a major advantage of WA is the effectiveness in killing cancer cells without side effects such as fatigue and pain.\u0026nbsp;\u003c/div\u003e\u003cdiv\u003eSee:\u0026nbsp;\u003ca href=\"http://www.tandfonline.com/doi/pdf/10.1080/15384047.2015.1046651\"\u003ehttp://www.tandfonline.com/doi/pdf/10.1080/15384047.2015.1046651\u003c/a\u003e\u003c/div\u003e","link":"","linkType":"category","linkValue":"","image":"img_default/1_cancer.png","publishedDate":"\/Date(1481353657657)\/","rank":50,"beginDate":"\/Date(1481353657657)\/","endDate":"\/Date(1481353657657)\/","totalRows":0,"warnings":"Ashwagandha can cause thyrotoxicosis, or excess thyroid hormone effects, which is a potentially serious side effect that may be fatal.","sideeffects":"","dosage":"WARNING","anticoagulant":false,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":false,"carousel_caption":"","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"","FeedId":"6cfb2216-3c9b-480a-9c57-a318dbc1dbc0","category":"sol_cancer","title":"UMI-77","author":"","shortDescription":"\u003cdiv\u003eUMI-77 blocks pancreatic cancer growth in vitro and in vivo.\u003c/div\u003e\u003cdiv\u003eSee: \u003ca href=\"https://www.ncbi.nlm.nih.gov/pubmed/24019208\"\u003ehttps://www.ncbi.nlm.nih.gov/pubmed/24019208\u003c/a\u003e\u003c/div\u003e","description":"\u003cdiv\u003eUMI-77 blocks pancreatic cancer growth in vitro and in vivo.\u003c/div\u003e\u003cdiv\u003eSee:\u0026nbsp;\u003ca href=\"https://www.ncbi.nlm.nih.gov/pubmed/24019208\"\u003ehttps://www.ncbi.nlm.nih.gov/pubmed/24019208\u003c/a\u003e\u003c/div\u003e","link":"","linkType":"category","linkValue":"","image":"img_default/1_cancer.png","publishedDate":"\/Date(1481348165453)\/","rank":50,"beginDate":"\/Date(1481348165453)\/","endDate":"\/Date(1481348165453)\/","totalRows":0,"warnings":"DO NOT TAKE THIS UNLESS THE STRICT SUPERVISION OF A PHYSICIAN","sideeffects":"","dosage":"WARNING","anticoagulant":false,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":false,"carousel_caption":"","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"},{"bodyLinks":"","FeedId":"8a3e26f1-0d4a-4380-a05f-d1fd55a97f5d","category":"sol_cancer","title":"Lycopene","author":"","shortDescription":"Developing laboratory research suggests lycopene might worsen established prostate cancer by increasing the spread of cancer without having any effect on cancer cell growth.\u0026nbsp;\u003cspan style=\"font-weight: 700;\"\u003eUntil more is known, avoid lycopene if you have a prostate cancer diagnosis.\u003c/span\u003e","description":"Developing laboratory research suggests lycopene might worsen established prostate cancer by increasing the spread of cancer without having any effect on cancer cell growth.\u0026nbsp;\u003cspan style=\"font-weight: 700;\"\u003eUntil more is known, avoid lycopene if you have a prostate cancer diagnosis.\u003c/span\u003e","link":"","linkType":"category","linkValue":"","image":"img_default/1_cancer.png","publishedDate":"\/Date(1481329017540)\/","rank":50,"beginDate":"\/Date(1481329017540)\/","endDate":"\/Date(1481329017540)\/","totalRows":0,"warnings":"Developing laboratory research suggests lycopene might worsen established prostate cancer by increasing the spread of cancer without having any effect on cancer cell growth. \u003cb\u003eUntil more is known, avoid lycopene if you have a prostate cancer diagnosis.\u003c/b\u003e","sideeffects":"","dosage":"WARNING","anticoagulant":false,"carcinogenic":false,"hypoglycemic":false,"liverdamage":false,"kidneydamage":false,"city":"","state":"","postalCode":"","country":"","areaCode":"","closed":false,"carousel":false,"carousel_caption":"","showvideo":false,"moviecategory":"SciFi","duration":"00:00:00"}]